mazent/STM32/Dispi/mmc/mz_hal_mmc.c
/*
 * Usare questo file al posto di stm32h7xx_hal_mmc.c perche'
 * aggiunge le operazioni necessarie ad accedere al RPMB
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

// Aggiungo queste
#define MMC_CONTEXT_WRITE_MULTIPLE       ( (uint32_t) 0x00000100 )
#define MMC_CONTEXT_READ_MULTIPLE        ( (uint32_t) 0x00000200 )


#ifdef HAL_MMC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup MMC_Private_Defines
  * @{
  */
#if defined (VDD_VALUE) && (VDD_VALUE <= 1950U)
#define MMC_VOLTAGE_RANGE               EMMC_LOW_VOLTAGE_RANGE

#define MMC_EXT_CSD_PWR_CL_26_INDEX     201
#define MMC_EXT_CSD_PWR_CL_52_INDEX     200
#define MMC_EXT_CSD_PWR_CL_DDR_52_INDEX 238

#define MMC_EXT_CSD_PWR_CL_26_POS       8
#define MMC_EXT_CSD_PWR_CL_52_POS       0
#define MMC_EXT_CSD_PWR_CL_DDR_52_POS   16
#else
#define MMC_VOLTAGE_RANGE               EMMC_HIGH_VOLTAGE_RANGE

#define MMC_EXT_CSD_PWR_CL_26_INDEX     203
#define MMC_EXT_CSD_PWR_CL_52_INDEX     202
#define MMC_EXT_CSD_PWR_CL_DDR_52_INDEX 239

#define MMC_EXT_CSD_PWR_CL_26_POS       24
#define MMC_EXT_CSD_PWR_CL_52_POS       16
#define MMC_EXT_CSD_PWR_CL_DDR_52_POS   24
#endif /* (VDD_VALUE) && (VDD_VALUE <= 1950U)*/

#define MMC_EXT_CSD_SLEEP_NOTIFICATION_TIME_INDEX 216
#define MMC_EXT_CSD_SLEEP_NOTIFICATION_TIME_POS   0
#define MMC_EXT_CSD_S_A_TIMEOUT_INDEX             217
#define MMC_EXT_CSD_S_A_TIMEOUT_POS               8

/* Frequencies used in the driver for clock divider calculation */
#define MMC_INIT_FREQ                   400000U   /* Initialization phase : 400 kHz max */
#define MMC_HIGH_SPEED_FREQ             52000000U /* High speed phase : 52 MHz max */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup MMC_Private_Functions MMC Private Functions
  * @{
  */
static uint32_t MMC_InitCard(MMC_HandleTypeDef * hmmc) ;
static uint32_t MMC_PowerON(MMC_HandleTypeDef * hmmc) ;
static uint32_t MMC_SendStatus(
    MMC_HandleTypeDef * hmmc,
    uint32_t * pCardStatus) ;
static void MMC_PowerOFF(MMC_HandleTypeDef * hmmc) ;
static void MMC_Write_IT(MMC_HandleTypeDef * hmmc) ;
static void MMC_Read_IT(MMC_HandleTypeDef * hmmc) ;
static uint32_t MMC_HighSpeed(
    MMC_HandleTypeDef * hmmc,
    FunctionalState state) ;
static uint32_t MMC_DDR_Mode(
    MMC_HandleTypeDef * hmmc,
    FunctionalState state) ;
static HAL_StatusTypeDef MMC_ReadExtCSD(
    MMC_HandleTypeDef * hmmc,
    uint32_t * pFieldData,
    uint16_t FieldIndex,
    uint32_t Timeout) ;
static uint32_t MMC_PwrClassUpdate(
    MMC_HandleTypeDef * hmmc,
    uint32_t Wide,
    uint32_t Speed) ;

/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup MMC_Exported_Functions
  * @{
  */

/** @addtogroup MMC_Exported_Functions_Group1
  *  @brief   Initialization and de-initialization functions
  *
@verbatim
  ==============================================================================
          ##### Initialization and de-initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to initialize/de-initialize the MMC
    card device to be ready for use.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the MMC according to the specified parameters in the
            MMC_HandleTypeDef and create the associated handle.
  * @param  hmmc: Pointer to the MMC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_Init(MMC_HandleTypeDef * hmmc)
{
    /* Check the MMC handle allocation */
    if ( hmmc == NULL ) {
        return HAL_ERROR ;
    }

    /* Check the parameters */
    assert_param( IS_SDMMC_ALL_INSTANCE(hmmc->Instance) ) ;
    assert_param( IS_SDMMC_CLOCK_EDGE(hmmc->Init.ClockEdge) ) ;
    assert_param( IS_SDMMC_CLOCK_POWER_SAVE(hmmc->Init.ClockPowerSave) ) ;
    assert_param( IS_SDMMC_BUS_WIDE(hmmc->Init.BusWide) ) ;
    assert_param( IS_SDMMC_HARDWARE_FLOW_CONTROL(hmmc->Init.HardwareFlowControl) ) ;
    assert_param( IS_SDMMC_CLKDIV(hmmc->Init.ClockDiv) ) ;

    if ( hmmc->State == HAL_MMC_STATE_RESET ) {
        /* Allocate lock resource and initialize it */
        hmmc->Lock = HAL_UNLOCKED ;
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
        (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
        /* Reset Callback pointers in HAL_MMC_STATE_RESET only */
        hmmc->TxCpltCallback = HAL_MMC_TxCpltCallback ;
        hmmc->RxCpltCallback = HAL_MMC_RxCpltCallback ;
        hmmc->ErrorCallback = HAL_MMC_ErrorCallback ;
        hmmc->AbortCpltCallback = HAL_MMC_AbortCallback ;
        hmmc->Read_DMADblBuf0CpltCallback =
            HAL_MMCEx_Read_DMADoubleBuf0CpltCallback ;
        hmmc->Read_DMADblBuf1CpltCallback =
            HAL_MMCEx_Read_DMADoubleBuf1CpltCallback ;
        hmmc->Write_DMADblBuf0CpltCallback =
            HAL_MMCEx_Write_DMADoubleBuf0CpltCallback ;
        hmmc->Write_DMADblBuf1CpltCallback =
            HAL_MMCEx_Write_DMADoubleBuf1CpltCallback ;

        if ( hmmc->MspInitCallback == NULL ) {
            hmmc->MspInitCallback = HAL_MMC_MspInit ;
        }

        /* Init the low level hardware */
        hmmc->MspInitCallback(hmmc) ;
#else
        /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
        HAL_MMC_MspInit(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
    }

    hmmc->State = HAL_MMC_STATE_BUSY ;

    /* Initialize the Card parameters */
    if ( HAL_MMC_InitCard(hmmc) == HAL_ERROR ) {
        return HAL_ERROR ;
    }

    /* Initialize the error code */
    hmmc->ErrorCode = HAL_DMA_ERROR_NONE ;

