mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    /* Initialize the MMC operation */
    hmmc->Context = MMC_CONTEXT_NONE ;

    /* Initialize the MMC state */
    hmmc->State = HAL_MMC_STATE_READY ;

    /* Configure bus width */
    if ( hmmc->Init.BusWide != SDMMC_BUS_WIDE_1B ) {
        if ( HAL_MMC_ConfigWideBusOperation(hmmc,
                                            hmmc->Init.BusWide) != HAL_OK ) {
            return HAL_ERROR ;
        }
    }

    return HAL_OK ;
}

/**
  * @brief  Initializes the MMC Card.
  * @param  hmmc: Pointer to MMC handle
  * @note   This function initializes the MMC card. It could be used when a card
            re-initialization is needed.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_InitCard(MMC_HandleTypeDef * hmmc)
{
    uint32_t errorstate ;
    MMC_InitTypeDef Init ;
    uint32_t sdmmc_clk ;

    /* Default SDMMC peripheral configuration for MMC card initialization */
    Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING ;
    Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE ;
    Init.BusWide = SDMMC_BUS_WIDE_1B ;
    Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE ;

    /* Init Clock should be less or equal to 400Khz*/
    sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC) ;
    if ( sdmmc_clk == 0U ) {
        hmmc->State = HAL_MMC_STATE_READY ;
        hmmc->ErrorCode = SDMMC_ERROR_INVALID_PARAMETER ;
        return HAL_ERROR ;
    }
    Init.ClockDiv = sdmmc_clk / (2U * MMC_INIT_FREQ) ;

#if (USE_SD_TRANSCEIVER != 0U)
    Init.TranceiverPresent = SDMMC_TRANSCEIVER_NOT_PRESENT ;
#endif /* USE_SD_TRANSCEIVER */

    /* Initialize SDMMC peripheral interface with default configuration */
    (void) SDMMC_Init(hmmc->Instance, Init) ;

    /* Set Power State to ON */
    (void) SDMMC_PowerState_ON(hmmc->Instance) ;

    /* wait 74 Cycles: required power up waiting time before starting
       the MMC initialization sequence */
    sdmmc_clk = sdmmc_clk / (2U * Init.ClockDiv) ;
    HAL_Delay( 1U + ( 74U * 1000U / (sdmmc_clk) ) ) ;

    /* Identify card operating voltage */
    errorstate = MMC_PowerON(hmmc) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        hmmc->State = HAL_MMC_STATE_READY ;
        hmmc->ErrorCode |= errorstate ;
        return HAL_ERROR ;
    }

    /* Card initialization */
    errorstate = MMC_InitCard(hmmc) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        hmmc->State = HAL_MMC_STATE_READY ;
        hmmc->ErrorCode |= errorstate ;
        return HAL_ERROR ;
    }

    /* Set Block Size for Card */
    errorstate = SDMMC_CmdBlockLength(hmmc->Instance, MMC_BLOCKSIZE) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= errorstate ;
        hmmc->State = HAL_MMC_STATE_READY ;
        return HAL_ERROR ;
    }

    return HAL_OK ;
}

/**
  * @brief  De-Initializes the MMC card.
  * @param  hmmc: Pointer to MMC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_DeInit(MMC_HandleTypeDef * hmmc)
{
    /* Check the MMC handle allocation */
    if ( hmmc == NULL ) {
        return HAL_ERROR ;
    }

    /* Check the parameters */
    assert_param( IS_SDMMC_ALL_INSTANCE(hmmc->Instance) ) ;

    hmmc->State = HAL_MMC_STATE_BUSY ;

    /* Set MMC power state to off */
    MMC_PowerOFF(hmmc) ;

#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
    (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
    if ( hmmc->MspDeInitCallback == NULL ) {
        hmmc->MspDeInitCallback = HAL_MMC_MspDeInit ;
    }

    /* DeInit the low level hardware */
    hmmc->MspDeInitCallback(hmmc) ;
#else
    /* De-Initialize the MSP layer */
    HAL_MMC_MspDeInit(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */

    hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;
    hmmc->State = HAL_MMC_STATE_RESET ;

    return HAL_OK ;
}

/**
  * @brief  Initializes the MMC MSP.
  * @param  hmmc: Pointer to MMC handle
  * @retval None
  */
__weak void HAL_MMC_MspInit(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function Should not be modified, when the callback is needed,
              the HAL_MMC_MspInit could be implemented in the user file
     */
}

/**
  * @brief  De-Initialize MMC MSP.
  * @param  hmmc: Pointer to MMC handle
  * @retval None
  */
__weak void HAL_MMC_MspDeInit(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function Should not be modified, when the callback is needed,
              the HAL_MMC_MspDeInit could be implemented in the user file
     */
}

/**
  * @}
  */

/** @addtogroup MMC_Exported_Functions_Group2
  *  @brief   Data transfer functions
  *
@verbatim
  ==============================================================================
                        ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the data
    transfer from/to MMC card.

@endverbatim
  * @{
  */

/**
  * @brief  Reads block(s) from a specified address in a card. The Data transfer
  *         is managed by polling mode.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @param  hmmc: Pointer to MMC handle
  * @param  pData: pointer to the buffer that will contain the received data
  * @param  BlockAdd: Block Address from where data is to be read
  * @param  NumberOfBlocks: Number of MMC blocks to read
  * @param  Timeout: Specify timeout value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_ReadBlocks(
    MMC_HandleTypeDef * hmmc,
    uint8_t * pData,
    uint32_t BlockAdd,
    uint32_t NumberOfBlocks,
    uint32_t Timeout)
{
    SDMMC_DataInitTypeDef config ;
    uint32_t errorstate ;
    uint32_t tickstart = HAL_GetTick() ;
    uint32_t count ;
    uint32_t data ;
    uint32_t dataremaining ;
    uint32_t add = BlockAdd ;
    uint8_t * tempbuff = pData ;

    if ( NULL == pData ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        return HAL_ERROR ;
    }

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

        if ( (BlockAdd + NumberOfBlocks) > (hmmc->MmcCard.LogBlockNbr) ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_OUT_OF_RANGE ;
            return HAL_ERROR ;
        }

        /* Check the case of 4kB blocks (field DATA SECTOR SIZE of extended CSD register) */
        if ( ( (hmmc->Ext_CSD[(MMC_EXT_CSD_DATA_SEC_SIZE_INDEX
                               / 4)] >> MMC_EXT_CSD_DATA_SEC_SIZE_POS)
               & 0x000000FFU ) != 0x0U ) {
            if ( (NumberOfBlocks % 8U) != 0U ) {
                /* The number of blocks should be a multiple of 8 sectors of 512 bytes = 4 KBytes */
                hmmc->ErrorCode |= HAL_MMC_ERROR_BLOCK_LEN_ERR ;
                return HAL_ERROR ;
            }

