mazent/STM32/Dispi/mmc/mz_hal_mmc.c
            if ( (BlockAdd % 8U) != 0U ) {
                /* The address should be aligned to 8 (corresponding to 4 KBytes blocks) */
                hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_MISALIGNED ;
                return HAL_ERROR ;
            }
        }

        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Initialize data control register */
        hmmc->Instance->DCTRL = 0U ;

        if ( (hmmc->MmcCard.CardType) != MMC_HIGH_CAPACITY_CARD ) {
            add *= 512U ;
        }

        /* Configure the MMC DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT ;
        config.DataLength = NumberOfBlocks * MMC_BLOCKSIZE ;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B ;
        config.TransferDir = SDMMC_TRANSFER_DIR_TO_CARD ;
        config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK ;
        config.DPSM = SDMMC_DPSM_DISABLE ;
        (void) SDMMC_ConfigData(hmmc->Instance, &config) ;
        __SDMMC_CMDTRANS_ENABLE(hmmc->Instance) ;

        /* Write Blocks in Polling mode */
        if ( NumberOfBlocks > 1U ) {
            hmmc->Context = MMC_CONTEXT_WRITE_MULTIPLE_BLOCK ;

            /* Write Multi Block command */
            errorstate = SDMMC_CmdWriteMultiBlock(hmmc->Instance, add) ;
        }
        else {
            hmmc->Context = MMC_CONTEXT_WRITE_SINGLE_BLOCK ;

            /* Write Single Block command */
            errorstate = SDMMC_CmdWriteSingleBlock(hmmc->Instance, add) ;
        }
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* Write block(s) in polling mode */
        dataremaining = config.DataLength ;
        while ( !__HAL_MMC_GET_FLAG(hmmc,
                                    SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DCRCFAIL
                                    | SDMMC_FLAG_DTIMEOUT
                                    | SDMMC_FLAG_DATAEND) ) {
            if ( __HAL_MMC_GET_FLAG(hmmc,
                                    SDMMC_FLAG_TXFIFOHE) &&
                 (dataremaining >= 32U) ) {
                /* Write data to SDMMC Tx FIFO */
                for ( count = 0U ; count < 8U ; count++ ) {
                    data = (uint32_t) (*tempbuff) ;
                    tempbuff++ ;
                    data |= ( (uint32_t) (*tempbuff) << 8U ) ;
                    tempbuff++ ;
                    data |= ( (uint32_t) (*tempbuff) << 16U ) ;
                    tempbuff++ ;
                    data |= ( (uint32_t) (*tempbuff) << 24U ) ;
                    tempbuff++ ;
                    (void) SDMMC_WriteFIFO(hmmc->Instance, &data) ;
                }
                dataremaining -= 32U ;
            }

            if ( ( (HAL_GetTick() - tickstart) >= Timeout ) ||
                 (Timeout == 0U) ) {
                /* Clear all the static flags */
                __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
                hmmc->ErrorCode |= errorstate ;
                hmmc->State = HAL_MMC_STATE_READY ;
                return HAL_TIMEOUT ;
            }
        }
        __SDMMC_CMDTRANS_DISABLE(hmmc->Instance) ;

        /* Send stop transmission command in case of multiblock write */
        if ( __HAL_MMC_GET_FLAG(hmmc,
                                SDMMC_FLAG_DATAEND) &&
             (NumberOfBlocks > 1U) ) {
            /* Send stop transmission command */
            errorstate = SDMMC_CmdStopTransfer(hmmc->Instance) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                /* Clear all the static flags */
                __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
                hmmc->ErrorCode |= errorstate ;
                hmmc->State = HAL_MMC_STATE_READY ;
                return HAL_ERROR ;
            }
        }

        /* Get error state */
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DTIMEOUT) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_TIMEOUT ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }
        else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DCRCFAIL) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_CRC_FAIL ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }
        else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_TXUNDERR) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_TX_UNDERRUN ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }
        else {
            /* Nothing to do */
        }

        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

        hmmc->State = HAL_MMC_STATE_READY ;

        return HAL_OK ;
    }
    else {
        hmmc->ErrorCode |= HAL_MMC_ERROR_BUSY ;
        return HAL_ERROR ;
    }
}

/**
  * @brief  Reads block(s) from a specified address in a card. The Data transfer
  *         is managed in interrupt mode.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @note   You could also check the IT transfer process through the MMC Rx
  *         interrupt event.
  * @param  hmmc: Pointer to MMC handle
  * @param  pData: Pointer to the buffer that will contain the received data
  * @param  BlockAdd: Block Address from where data is to be read
  * @param  NumberOfBlocks: Number of blocks to read.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_ReadBlocks_IT(
    MMC_HandleTypeDef * hmmc,
    uint8_t * pData,
    uint32_t BlockAdd,
    uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config ;
    uint32_t errorstate ;
    uint32_t add = BlockAdd ;

    if ( NULL == pData ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        return HAL_ERROR ;
    }

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

        if ( (BlockAdd + NumberOfBlocks) > (hmmc->MmcCard.LogBlockNbr) ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_OUT_OF_RANGE ;
            return HAL_ERROR ;
        }

        /* Check the case of 4kB blocks (field DATA SECTOR SIZE of extended CSD register) */
        if ( ( (hmmc->Ext_CSD[(MMC_EXT_CSD_DATA_SEC_SIZE_INDEX
                               / 4)]
                >> MMC_EXT_CSD_DATA_SEC_SIZE_POS) & 0x000000FFU ) != 0x0U ) {
            if ( (NumberOfBlocks % 8U) != 0U ) {
                /* The number of blocks should be a multiple of 8 sectors of 512 bytes = 4 KBytes */
                hmmc->ErrorCode |= HAL_MMC_ERROR_BLOCK_LEN_ERR ;
                return HAL_ERROR ;
            }

