mazent/STM32/Dispi/mmc/mz_hal_mmc.c
            if ( (BlockAdd % 8U) != 0U ) {
                /* The address should be aligned to 8 (corresponding to 4 KBytes blocks) */
                hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_MISALIGNED ;
                return HAL_ERROR ;
            }
        }

        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Initialize data control register */
        hmmc->Instance->DCTRL = 0U ;

        hmmc->pRxBuffPtr = pData ;
        hmmc->RxXferSize = MMC_BLOCKSIZE * NumberOfBlocks ;

        if ( (hmmc->MmcCard.CardType) != MMC_HIGH_CAPACITY_CARD ) {
            add *= 512U ;
        }

        /* Configure the MMC DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT ;
        config.DataLength = MMC_BLOCKSIZE * NumberOfBlocks ;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B ;
        config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC ;
        config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK ;
        config.DPSM = SDMMC_DPSM_DISABLE ;
        (void) SDMMC_ConfigData(hmmc->Instance, &config) ;

        __SDMMC_CMDTRANS_ENABLE(hmmc->Instance) ;
        hmmc->Instance->IDMABASE0 = (uint32_t) pData ;
        hmmc->Instance->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF ;

        /* Read Blocks in DMA mode */
        if ( NumberOfBlocks > 1U ) {
            hmmc->Context = (MMC_CONTEXT_READ_MULTIPLE_BLOCK | MMC_CONTEXT_DMA) ;

            /* Read Multi Block command */
            errorstate = SDMMC_CmdReadMultiBlock(hmmc->Instance, add) ;
        }
        else {
            hmmc->Context = (MMC_CONTEXT_READ_SINGLE_BLOCK | MMC_CONTEXT_DMA) ;

            /* Read Single Block command */
            errorstate = SDMMC_CmdReadSingleBlock(hmmc->Instance, add) ;
        }
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode = errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* Enable transfer interrupts */
        __HAL_MMC_ENABLE_IT( hmmc,
                             (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT
                              | SDMMC_IT_RXOVERR
                              | SDMMC_IT_DATAEND) ) ;

        return HAL_OK ;
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Writes block(s) to a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @note   You could also check the DMA transfer process through the MMC Tx
  *         interrupt event.
  * @param  hmmc: Pointer to MMC handle
  * @param  pData: Pointer to the buffer that will contain the data to transmit
  * @param  BlockAdd: Block Address where data will be written
  * @param  NumberOfBlocks: Number of blocks to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_WriteBlocks_DMA(
    MMC_HandleTypeDef * hmmc,
    uint8_t * pData,
    uint32_t BlockAdd,
    uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config ;
    uint32_t errorstate ;
    uint32_t add = BlockAdd ;

    if ( NULL == pData ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        return HAL_ERROR ;
    }

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

        if ( (BlockAdd + NumberOfBlocks) > (hmmc->MmcCard.LogBlockNbr) ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_OUT_OF_RANGE ;
            return HAL_ERROR ;
        }

        /* Check the case of 4kB blocks (field DATA SECTOR SIZE of extended CSD register) */
        if ( ( (hmmc->Ext_CSD[(MMC_EXT_CSD_DATA_SEC_SIZE_INDEX
                               / 4)]
                >> MMC_EXT_CSD_DATA_SEC_SIZE_POS) & 0x000000FFU ) != 0x0U ) {
            if ( (NumberOfBlocks % 8U) != 0U ) {
                /* The number of blocks should be a multiple of 8 sectors of 512 bytes = 4 KBytes */
                hmmc->ErrorCode |= HAL_MMC_ERROR_BLOCK_LEN_ERR ;
                return HAL_ERROR ;
            }

            if ( (BlockAdd % 8U) != 0U ) {
                /* The address should be aligned to 8 (corresponding to 4 KBytes blocks) */
                hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_MISALIGNED ;
                return HAL_ERROR ;
            }
        }

        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Initialize data control register */
        hmmc->Instance->DCTRL = 0U ;

        hmmc->pTxBuffPtr = pData ;
        hmmc->TxXferSize = MMC_BLOCKSIZE * NumberOfBlocks ;

        if ( (hmmc->MmcCard.CardType) != MMC_HIGH_CAPACITY_CARD ) {
            add *= 512U ;
        }

        /* Configure the MMC DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT ;
        config.DataLength = MMC_BLOCKSIZE * NumberOfBlocks ;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B ;
        config.TransferDir = SDMMC_TRANSFER_DIR_TO_CARD ;
        config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK ;
        config.DPSM = SDMMC_DPSM_DISABLE ;
        (void) SDMMC_ConfigData(hmmc->Instance, &config) ;

        __SDMMC_CMDTRANS_ENABLE(hmmc->Instance) ;

        hmmc->Instance->IDMABASE0 = (uint32_t) pData ;
        hmmc->Instance->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF ;

        /* Write Blocks in Polling mode */
        if ( NumberOfBlocks > 1U ) {
            hmmc->Context = (MMC_CONTEXT_WRITE_MULTIPLE_BLOCK | MMC_CONTEXT_DMA) ;

            /* Write Multi Block command */
            errorstate = SDMMC_CmdWriteMultiBlock(hmmc->Instance, add) ;
        }
        else {
            hmmc->Context = (MMC_CONTEXT_WRITE_SINGLE_BLOCK | MMC_CONTEXT_DMA) ;

            /* Write Single Block command */
            errorstate = SDMMC_CmdWriteSingleBlock(hmmc->Instance, add) ;
        }
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* Enable transfer interrupts */
        __HAL_MMC_ENABLE_IT( hmmc,
                             (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT
                              | SDMMC_IT_TXUNDERR
                              | SDMMC_IT_DATAEND) ) ;

        return HAL_OK ;
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Erases the specified memory area of the given MMC card.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @param  hmmc: Pointer to MMC handle
  * @param  BlockStartAdd: Start Block address
  * @param  BlockEndAdd: End Block address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_Erase(
    MMC_HandleTypeDef * hmmc,
    uint32_t BlockStartAdd,
    uint32_t BlockEndAdd)
{
    uint32_t errorstate ;
    uint32_t start_add = BlockStartAdd ;
    uint32_t end_add = BlockEndAdd ;

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

