mazent/STM32/Dispi/mmc/mz_hal_mmc.c
        if ( end_add < start_add ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
            return HAL_ERROR ;
        }

        if ( end_add > (hmmc->MmcCard.LogBlockNbr) ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_OUT_OF_RANGE ;
            return HAL_ERROR ;
        }

        /* Check the case of 4kB blocks (field DATA SECTOR SIZE of extended CSD register) */
        if ( ( (hmmc->Ext_CSD[(MMC_EXT_CSD_DATA_SEC_SIZE_INDEX
                               / 4)] >> MMC_EXT_CSD_DATA_SEC_SIZE_POS)
               & 0x000000FFU ) != 0x0U ) {
            if ( ( (start_add % 8U) != 0U ) || ( (end_add % 8U) != 0U ) ) {
                /* The address should be aligned to 8 (corresponding to 4 KBytes blocks) */
                hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_MISALIGNED ;
                return HAL_ERROR ;
            }
        }

        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Check if the card command class supports erase command */
        if ( ( (hmmc->MmcCard.Class) & SDMMC_CCCC_ERASE ) == 0U ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_REQUEST_NOT_APPLICABLE ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        if ( (SDMMC_GetResponse(hmmc->Instance,
                                SDMMC_RESP1) & SDMMC_CARD_LOCKED) ==
             SDMMC_CARD_LOCKED ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_LOCK_UNLOCK_FAILED ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        if ( (hmmc->MmcCard.CardType) != MMC_HIGH_CAPACITY_CARD ) {
            start_add *= 512U ;
            end_add *= 512U ;
        }

        /* Send CMD35 MMC_ERASE_GRP_START with argument as addr  */
        errorstate = SDMMC_CmdEraseStartAdd(hmmc->Instance, start_add) ;
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* Send CMD36 MMC_ERASE_GRP_END with argument as addr  */
        errorstate = SDMMC_CmdEraseEndAdd(hmmc->Instance, end_add) ;
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* Send CMD38 ERASE */
        errorstate = SDMMC_CmdErase(hmmc->Instance, 0UL) ;
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        hmmc->State = HAL_MMC_STATE_READY ;

        return HAL_OK ;
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  This function handles MMC card interrupt request.
  * @param  hmmc: Pointer to MMC handle
  * @retval None
  */
void HAL_MMC_IRQHandler(MMC_HandleTypeDef * hmmc)
{
    uint32_t errorstate ;
    uint32_t context = hmmc->Context ;

    /* Check for SDMMC interrupt flags */
    if ( (__HAL_MMC_GET_FLAG(hmmc,
                             SDMMC_FLAG_RXFIFOHF) != RESET) &&
         ( (context & MMC_CONTEXT_IT) != 0U ) ) {
        MMC_Read_IT(hmmc) ;
    }
    else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DATAEND) != RESET ) {
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_FLAG_DATAEND) ;

        __HAL_MMC_DISABLE_IT(
            hmmc,
            SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT   \
            | SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR
            | SDMMC_IT_TXFIFOHE   \
            | SDMMC_IT_RXFIFOHF) ;

        __HAL_MMC_DISABLE_IT(hmmc, SDMMC_IT_IDMABTC) ;
        __SDMMC_CMDTRANS_DISABLE(hmmc->Instance) ;

        if ( (context & MMC_CONTEXT_DMA) != 0U ) {
            hmmc->Instance->DLEN = 0 ;
            hmmc->Instance->DCTRL = 0 ;
            hmmc->Instance->IDMACTRL = SDMMC_DISABLE_IDMA ;

            if ( ( (context & MMC_CONTEXT_READ_MULTIPLE) != 0U ) ||
                 ( (context & MMC_CONTEXT_WRITE_MULTIPLE) != 0U ) ) {
                // Non devo fare niente
            }

            /* Stop Transfer for Write Multi blocks or Read Multi blocks */
            if ( ( (context & MMC_CONTEXT_READ_MULTIPLE_BLOCK) != 0U ) ||
                 ( (context & MMC_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U ) ) {
                errorstate = SDMMC_CmdStopTransfer(hmmc->Instance) ;
                if ( errorstate != HAL_MMC_ERROR_NONE ) {
                    hmmc->ErrorCode |= errorstate ;
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                    (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                    hmmc->ErrorCallback(hmmc) ;
#else
                    HAL_MMC_ErrorCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
                }
            }

            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

            hmmc->State = HAL_MMC_STATE_READY ;
            if ( ( (context & MMC_CONTEXT_WRITE_SINGLE_BLOCK) != 0U ) ||
                 ( (context & MMC_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U )
                 || ( (context & MMC_CONTEXT_WRITE_MULTIPLE) != 0U ) ) {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->TxCpltCallback(hmmc) ;
#else
                HAL_MMC_TxCpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
            if ( ( (context & MMC_CONTEXT_READ_SINGLE_BLOCK) != 0U ) ||
                 ( (context & MMC_CONTEXT_READ_MULTIPLE_BLOCK) != 0U )
                 || ( (context & MMC_CONTEXT_READ_MULTIPLE) != 0U ) ) {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->RxCpltCallback(hmmc) ;
#else
                HAL_MMC_RxCpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
        }
        else if ( (context & MMC_CONTEXT_IT) != 0U ) {
            /* Stop Transfer for Write Multi blocks or Read Multi blocks */
            if ( ( (context & MMC_CONTEXT_READ_MULTIPLE_BLOCK) != 0U ) ||
                 ( (context & MMC_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U ) ) {
                errorstate = SDMMC_CmdStopTransfer(hmmc->Instance) ;
                if ( errorstate != HAL_MMC_ERROR_NONE ) {
                    hmmc->ErrorCode |= errorstate ;
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                    (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                    hmmc->ErrorCallback(hmmc) ;
#else
                    HAL_MMC_ErrorCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
                }
            }

            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

            hmmc->State = HAL_MMC_STATE_READY ;
            if ( ( (context & MMC_CONTEXT_READ_SINGLE_BLOCK) != 0U ) ||
                 ( (context & MMC_CONTEXT_READ_MULTIPLE_BLOCK) != 0U ) ) {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->RxCpltCallback(hmmc) ;
#else
                HAL_MMC_RxCpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
            else {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->TxCpltCallback(hmmc) ;
#else
                HAL_MMC_TxCpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
        }
        else {
            /* Nothing to do */
        }
    }
    else if ( (__HAL_MMC_GET_FLAG(hmmc,
                                  SDMMC_FLAG_TXFIFOHE) != RESET) &&
              ( (context & MMC_CONTEXT_IT) != 0U ) ) {
        MMC_Write_IT(hmmc) ;
    }
    else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DCRCFAIL
                                 | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_RXOVERR
                                 | SDMMC_FLAG_TXUNDERR) != RESET ) {
        /* Set Error code */
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_IT_DCRCFAIL) != RESET ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_CRC_FAIL ;
        }
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_IT_DTIMEOUT) != RESET ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_TIMEOUT ;
        }
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_IT_RXOVERR) != RESET ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_RX_OVERRUN ;
        }
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_IT_TXUNDERR) != RESET ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_TX_UNDERRUN ;
        }

        /* Clear All flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

        /* Disable all interrupts */
        __HAL_MMC_DISABLE_IT(
            hmmc,
            SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL
            | SDMMC_IT_DTIMEOUT   \
            | SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR) ;

        __SDMMC_CMDTRANS_DISABLE(hmmc->Instance) ;
        hmmc->Instance->DCTRL |= SDMMC_DCTRL_FIFORST ;
        hmmc->Instance->CMD |= SDMMC_CMD_CMDSTOP ;
        hmmc->ErrorCode |= SDMMC_CmdStopTransfer(hmmc->Instance) ;
        hmmc->Instance->CMD &= ~(SDMMC_CMD_CMDSTOP) ;
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_FLAG_DABORT) ;

        if ( (context & MMC_CONTEXT_IT) != 0U ) {
            /* Set the MMC state to ready to be able to start again the process */
            hmmc->State = HAL_MMC_STATE_READY ;
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
            (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
            hmmc->ErrorCallback(hmmc) ;
#else
            HAL_MMC_ErrorCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
        }
        else if ( (context & MMC_CONTEXT_DMA) != 0U ) {
            if ( hmmc->ErrorCode != HAL_MMC_ERROR_NONE ) {
                /* Disable Internal DMA */
                __HAL_MMC_DISABLE_IT(hmmc, SDMMC_IT_IDMABTC) ;
                hmmc->Instance->IDMACTRL = SDMMC_DISABLE_IDMA ;

                /* Set the MMC state to ready to be able to start again the process */
                hmmc->State = HAL_MMC_STATE_READY ;
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->ErrorCallback(hmmc) ;
#else
                HAL_MMC_ErrorCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
        }
        else {
            /* Nothing to do */
        }
    }
    else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_IDMABTC) != RESET ) {
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_IT_IDMABTC) ;
        if ( READ_BIT(hmmc->Instance->IDMACTRL, SDMMC_IDMA_IDMABACT) == 0U ) {
            /* Current buffer is buffer0, Transfer complete for buffer1 */
            if ( (context & MMC_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U ) {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->Write_DMADblBuf1CpltCallback(hmmc) ;
#else
                HAL_MMCEx_Write_DMADoubleBuf1CpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
            else { /* MMC_CONTEXT_READ_MULTIPLE_BLOCK */
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->Read_DMADblBuf1CpltCallback(hmmc) ;
#else
                HAL_MMCEx_Read_DMADoubleBuf1CpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
        }
        else { /* MMC_DMA_BUFFER1 */
              /* Current buffer is buffer1, Transfer complete for buffer0 */
            if ( (context & MMC_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U ) {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->Write_DMADblBuf0CpltCallback(hmmc) ;
#else
                HAL_MMCEx_Write_DMADoubleBuf0CpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
            else { /* MMC_CONTEXT_READ_MULTIPLE_BLOCK */
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
                (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
                hmmc->Read_DMADblBuf0CpltCallback(hmmc) ;
#else
                HAL_MMCEx_Read_DMADoubleBuf0CpltCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
            }
        }
    }
    else {
        /* Nothing to do */
    }
}

/**
  * @brief return the MMC state
  * @param hmmc: Pointer to mmc handle
  * @retval HAL state
  */
HAL_MMC_StateTypeDef HAL_MMC_GetState(MMC_HandleTypeDef * hmmc)
{
    return hmmc->State ;
}

/**
  * @brief  Return the MMC error code
  * @param  hmmc : Pointer to a MMC_HandleTypeDef structure that contains
  *              the configuration information.
  * @retval MMC Error Code
  */
uint32_t HAL_MMC_GetError(MMC_HandleTypeDef * hmmc)
{
    return hmmc->ErrorCode ;
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hmmc: Pointer to MMC handle
  * @retval None
  */
__weak void HAL_MMC_TxCpltCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMC_TxCpltCallback can be implemented in the user file
     */
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hmmc: Pointer MMC handle
  * @retval None
  */
__weak void HAL_MMC_RxCpltCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMC_RxCpltCallback can be implemented in the user file
     */
}

/**
  * @brief MMC error callbacks
  * @param hmmc: Pointer MMC handle
  * @retval None
  */
__weak void HAL_MMC_ErrorCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMC_ErrorCallback can be implemented in the user file
     */
}

/**
  * @brief MMC Abort callbacks
  * @param hmmc: Pointer MMC handle
  * @retval None
  */
__weak void HAL_MMC_AbortCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMC_AbortCallback can be implemented in the user file
     */
}

#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
    (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User MMC Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hmmc : MMC handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_MMC_TX_CPLT_CB_ID                 MMC Tx Complete Callback ID
  *          @arg @ref HAL_MMC_RX_CPLT_CB_ID                 MMC Rx Complete Callback ID
  *          @arg @ref HAL_MMC_ERROR_CB_ID                   MMC Error Callback ID
  *          @arg @ref HAL_MMC_ABORT_CB_ID                   MMC Abort Callback ID
  *          @arg @ref HAL_MMC_READ_DMA_DBL_BUF0_CPLT_CB_ID  MMC DMA Rx Double buffer 0 Callback ID
  *          @arg @ref HAL_MMC_READ_DMA_DBL_BUF1_CPLT_CB_ID  MMC DMA Rx Double buffer 1 Callback ID
  *          @arg @ref HAL_MMC_WRITE_DMA_DBL_BUF0_CPLT_CB_ID MMC DMA Tx Double buffer 0 Callback ID
  *          @arg @ref HAL_MMC_WRITE_DMA_DBL_BUF1_CPLT_CB_ID MMC DMA Tx Double buffer 1 Callback ID
  *          @arg @ref HAL_MMC_MSP_INIT_CB_ID                MMC MspInit Callback ID
  *          @arg @ref HAL_MMC_MSP_DEINIT_CB_ID              MMC MspDeInit Callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_MMC_RegisterCallback(
    MMC_HandleTypeDef * hmmc,
    HAL_MMC_CallbackIDTypeDef CallbackId,
    pMMC_CallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK ;

