mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    if ( pCallback == NULL ) {
        /* Update the error code */
        hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
        return HAL_ERROR ;
    }

    /* Process locked */
    __HAL_LOCK(hmmc) ;

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        switch ( CallbackId ) {
        case HAL_MMC_TX_CPLT_CB_ID:
            hmmc->TxCpltCallback = pCallback ;
            break ;
        case HAL_MMC_RX_CPLT_CB_ID:
            hmmc->RxCpltCallback = pCallback ;
            break ;
        case HAL_MMC_ERROR_CB_ID:
            hmmc->ErrorCallback = pCallback ;
            break ;
        case HAL_MMC_ABORT_CB_ID:
            hmmc->AbortCpltCallback = pCallback ;
            break ;
        case HAL_MMC_READ_DMA_DBL_BUF0_CPLT_CB_ID:
            hmmc->Read_DMADblBuf0CpltCallback = pCallback ;
            break ;
        case HAL_MMC_READ_DMA_DBL_BUF1_CPLT_CB_ID:
            hmmc->Read_DMADblBuf1CpltCallback = pCallback ;
            break ;
        case HAL_MMC_WRITE_DMA_DBL_BUF0_CPLT_CB_ID:
            hmmc->Write_DMADblBuf0CpltCallback = pCallback ;
            break ;
        case HAL_MMC_WRITE_DMA_DBL_BUF1_CPLT_CB_ID:
            hmmc->Write_DMADblBuf1CpltCallback = pCallback ;
            break ;
        case HAL_MMC_MSP_INIT_CB_ID:
            hmmc->MspInitCallback = pCallback ;
            break ;
        case HAL_MMC_MSP_DEINIT_CB_ID:
            hmmc->MspDeInitCallback = pCallback ;
            break ;
        default:
            /* Update the error code */
            hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
            /* update return status */
            status = HAL_ERROR ;
            break ;
        }
    }
    else if ( hmmc->State == HAL_MMC_STATE_RESET ) {
        switch ( CallbackId ) {
        case HAL_MMC_MSP_INIT_CB_ID:
            hmmc->MspInitCallback = pCallback ;
            break ;
        case HAL_MMC_MSP_DEINIT_CB_ID:
            hmmc->MspDeInitCallback = pCallback ;
            break ;
        default:
            /* Update the error code */
            hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
            /* update return status */
            status = HAL_ERROR ;
            break ;
        }
    }
    else {
        /* Update the error code */
        hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
        /* update return status */
        status = HAL_ERROR ;
    }

    /* Release Lock */
    __HAL_UNLOCK(hmmc) ;
    return status ;
}

/**
  * @brief  Unregister a User MMC Callback
  *         MMC Callback is redirected to the weak (surcharged) predefined callback
  * @param hmmc : MMC handle
  * @param CallbackId : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_MMC_TX_CPLT_CB_ID                 MMC Tx Complete Callback ID
  *          @arg @ref HAL_MMC_RX_CPLT_CB_ID                 MMC Rx Complete Callback ID
  *          @arg @ref HAL_MMC_ERROR_CB_ID                   MMC Error Callback ID
  *          @arg @ref HAL_MMC_ABORT_CB_ID                   MMC Abort Callback ID
  *          @arg @ref HAL_MMC_READ_DMA_DBL_BUF0_CPLT_CB_ID  MMC DMA Rx Double buffer 0 Callback ID
  *          @arg @ref HAL_MMC_READ_DMA_DBL_BUF1_CPLT_CB_ID  MMC DMA Rx Double buffer 1 Callback ID
  *          @arg @ref HAL_MMC_WRITE_DMA_DBL_BUF0_CPLT_CB_ID MMC DMA Tx Double buffer 0 Callback ID
  *          @arg @ref HAL_MMC_WRITE_DMA_DBL_BUF1_CPLT_CB_ID MMC DMA Tx Double buffer 1 Callback ID
  *          @arg @ref HAL_MMC_MSP_INIT_CB_ID                MMC MspInit Callback ID
  *          @arg @ref HAL_MMC_MSP_DEINIT_CB_ID              MMC MspDeInit Callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_MMC_UnRegisterCallback(
    MMC_HandleTypeDef * hmmc,
    HAL_MMC_CallbackIDTypeDef CallbackId)
{
    HAL_StatusTypeDef status = HAL_OK ;

    /* Process locked */
    __HAL_LOCK(hmmc) ;

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        switch ( CallbackId ) {
        case HAL_MMC_TX_CPLT_CB_ID:
            hmmc->TxCpltCallback = HAL_MMC_TxCpltCallback ;
            break ;
        case HAL_MMC_RX_CPLT_CB_ID:
            hmmc->RxCpltCallback = HAL_MMC_RxCpltCallback ;
            break ;
        case HAL_MMC_ERROR_CB_ID:
            hmmc->ErrorCallback = HAL_MMC_ErrorCallback ;
            break ;
        case HAL_MMC_ABORT_CB_ID:
            hmmc->AbortCpltCallback = HAL_MMC_AbortCallback ;
            break ;
        case HAL_MMC_READ_DMA_DBL_BUF0_CPLT_CB_ID:
            hmmc->Read_DMADblBuf0CpltCallback =
                HAL_MMCEx_Read_DMADoubleBuf0CpltCallback ;
            break ;
        case HAL_MMC_READ_DMA_DBL_BUF1_CPLT_CB_ID:
            hmmc->Read_DMADblBuf1CpltCallback =
                HAL_MMCEx_Read_DMADoubleBuf1CpltCallback ;
            break ;
        case HAL_MMC_WRITE_DMA_DBL_BUF0_CPLT_CB_ID:
            hmmc->Write_DMADblBuf0CpltCallback =
                HAL_MMCEx_Write_DMADoubleBuf0CpltCallback ;
            break ;
        case HAL_MMC_WRITE_DMA_DBL_BUF1_CPLT_CB_ID:
            hmmc->Write_DMADblBuf1CpltCallback =
                HAL_MMCEx_Write_DMADoubleBuf1CpltCallback ;
            break ;
        case HAL_MMC_MSP_INIT_CB_ID:
            hmmc->MspInitCallback = HAL_MMC_MspInit ;
            break ;
        case HAL_MMC_MSP_DEINIT_CB_ID:
            hmmc->MspDeInitCallback = HAL_MMC_MspDeInit ;
            break ;
        default:
            /* Update the error code */
            hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
            /* update return status */
            status = HAL_ERROR ;
            break ;
        }
    }
    else if ( hmmc->State == HAL_MMC_STATE_RESET ) {
        switch ( CallbackId ) {
        case HAL_MMC_MSP_INIT_CB_ID:
            hmmc->MspInitCallback = HAL_MMC_MspInit ;
            break ;
        case HAL_MMC_MSP_DEINIT_CB_ID:
            hmmc->MspDeInitCallback = HAL_MMC_MspDeInit ;
            break ;
        default:
            /* Update the error code */
            hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
            /* update return status */
            status = HAL_ERROR ;
            break ;
        }
    }
    else {
        /* Update the error code */
        hmmc->ErrorCode |= HAL_MMC_ERROR_INVALID_CALLBACK ;
        /* update return status */
        status = HAL_ERROR ;
    }

    /* Release Lock */
    __HAL_UNLOCK(hmmc) ;
    return status ;
}

#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup MMC_Exported_Functions_Group3
  *  @brief   management functions
  *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the MMC card
    operations and get the related information

@endverbatim
  * @{
  */

/**
  * @brief  Returns information the information of the card which are stored on
  *         the CID register.
  * @param  hmmc: Pointer to MMC handle
  * @param  pCID: Pointer to a HAL_MMC_CIDTypedef structure that
  *         contains all CID register parameters
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_GetCardCID(
    MMC_HandleTypeDef * hmmc,
    HAL_MMC_CardCIDTypeDef * pCID)
{
    pCID->ManufacturerID = (uint8_t) ( (hmmc->CID[0] & 0xFF000000U) >> 24U ) ;

    pCID->OEM_AppliID = (uint16_t) ( (hmmc->CID[0] & 0x00FFFF00U) >> 8U ) ;

