mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    pCID->ProdName1 =
        ( ( (hmmc->CID[0]
             & 0x000000FFU) << 24U ) | ( (hmmc->CID[1] & 0xFFFFFF00U) >> 8U ) ) ;

    pCID->ProdName2 = (uint8_t) (hmmc->CID[1] & 0x000000FFU) ;

    pCID->ProdRev = (uint8_t) ( (hmmc->CID[2] & 0xFF000000U) >> 24U ) ;

    pCID->ProdSN =
        ( ( (hmmc->CID[2]
             & 0x00FFFFFFU) << 8U ) | ( (hmmc->CID[3] & 0xFF000000U) >> 24U ) ) ;

    pCID->Reserved1 = (uint8_t) ( (hmmc->CID[3] & 0x00F00000U) >> 20U ) ;

    pCID->ManufactDate = (uint16_t) ( (hmmc->CID[3] & 0x000FFF00U) >> 8U ) ;

    pCID->CID_CRC = (uint8_t) ( (hmmc->CID[3] & 0x000000FEU) >> 1U ) ;

    pCID->Reserved2 = 1U ;

    return HAL_OK ;
}

/**
  * @brief  Returns information the information of the card which are stored on
  *         the CSD register.
  * @param  hmmc: Pointer to MMC handle
  * @param  pCSD: Pointer to a HAL_MMC_CardCSDTypeDef structure that
  *         contains all CSD register parameters
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_GetCardCSD(
    MMC_HandleTypeDef * hmmc,
    HAL_MMC_CardCSDTypeDef * pCSD)
{
    uint32_t block_nbr = 0 ;

    pCSD->CSDStruct = (uint8_t) ( (hmmc->CSD[0] & 0xC0000000U) >> 30U ) ;

    pCSD->SysSpecVersion = (uint8_t) ( (hmmc->CSD[0] & 0x3C000000U) >> 26U ) ;

    pCSD->Reserved1 = (uint8_t) ( (hmmc->CSD[0] & 0x03000000U) >> 24U ) ;

    pCSD->TAAC = (uint8_t) ( (hmmc->CSD[0] & 0x00FF0000U) >> 16U ) ;

    pCSD->NSAC = (uint8_t) ( (hmmc->CSD[0] & 0x0000FF00U) >> 8U ) ;

    pCSD->MaxBusClkFrec = (uint8_t) (hmmc->CSD[0] & 0x000000FFU) ;

    pCSD->CardComdClasses = (uint16_t) ( (hmmc->CSD[1] & 0xFFF00000U) >> 20U ) ;

    pCSD->RdBlockLen = (uint8_t) ( (hmmc->CSD[1] & 0x000F0000U) >> 16U ) ;

    pCSD->PartBlockRead = (uint8_t) ( (hmmc->CSD[1] & 0x00008000U) >> 15U ) ;

    pCSD->WrBlockMisalign = (uint8_t) ( (hmmc->CSD[1] & 0x00004000U) >> 14U ) ;

    pCSD->RdBlockMisalign = (uint8_t) ( (hmmc->CSD[1] & 0x00002000U) >> 13U ) ;

    pCSD->DSRImpl = (uint8_t) ( (hmmc->CSD[1] & 0x00001000U) >> 12U ) ;

    pCSD->Reserved2 = 0U ; /*!< Reserved */

    if ( MMC_ReadExtCSD(hmmc, &block_nbr, 212, 0x0FFFFFFFU) != HAL_OK ) { /* Field SEC_COUNT [215:212] */
        return HAL_ERROR ;
    }

    if ( hmmc->MmcCard.CardType == MMC_LOW_CAPACITY_CARD ) {
        pCSD->DeviceSize =
            ( ( (hmmc->CSD[1]
                 & 0x000003FFU) << 2U ) | ( (hmmc->CSD[2] & 0xC0000000U) >> 30U ) ) ;

        pCSD->MaxRdCurrentVDDMin =
            (uint8_t) ( (hmmc->CSD[2] & 0x38000000U) >> 27U ) ;

        pCSD->MaxRdCurrentVDDMax =
            (uint8_t) ( (hmmc->CSD[2] & 0x07000000U) >> 24U ) ;

        pCSD->MaxWrCurrentVDDMin =
            (uint8_t) ( (hmmc->CSD[2] & 0x00E00000U) >> 21U ) ;

        pCSD->MaxWrCurrentVDDMax =
            (uint8_t) ( (hmmc->CSD[2] & 0x001C0000U) >> 18U ) ;

        pCSD->DeviceSizeMul = (uint8_t) ( (hmmc->CSD[2] & 0x00038000U) >> 15U ) ;

        hmmc->MmcCard.BlockNbr = (pCSD->DeviceSize + 1U) ;
        hmmc->MmcCard.BlockNbr *= ( 1UL << ( (pCSD->DeviceSizeMul & 0x07U) + 2U ) ) ;
        hmmc->MmcCard.BlockSize = ( 1UL << (pCSD->RdBlockLen & 0x0FU) ) ;

        hmmc->MmcCard.LogBlockNbr = (hmmc->MmcCard.BlockNbr)
                                    * ( (hmmc->MmcCard.BlockSize) / 512U ) ;
        hmmc->MmcCard.LogBlockSize = 512U ;
    }
    else if ( hmmc->MmcCard.CardType == MMC_HIGH_CAPACITY_CARD ) {
        hmmc->MmcCard.BlockNbr = block_nbr ;
        hmmc->MmcCard.LogBlockNbr = hmmc->MmcCard.BlockNbr ;
        hmmc->MmcCard.BlockSize = 512U ;
        hmmc->MmcCard.LogBlockSize = hmmc->MmcCard.BlockSize ;
    }
    else {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= HAL_MMC_ERROR_UNSUPPORTED_FEATURE ;
        hmmc->State = HAL_MMC_STATE_READY ;
        return HAL_ERROR ;
    }

    pCSD->EraseGrSize = (uint8_t) ( (hmmc->CSD[2] & 0x00004000U) >> 14U ) ;

    pCSD->EraseGrMul = (uint8_t) ( (hmmc->CSD[2] & 0x00003F80U) >> 7U ) ;

    pCSD->WrProtectGrSize = (uint8_t) (hmmc->CSD[2] & 0x0000007FU) ;

    pCSD->WrProtectGrEnable = (uint8_t) ( (hmmc->CSD[3] & 0x80000000U) >> 31U ) ;

    pCSD->ManDeflECC = (uint8_t) ( (hmmc->CSD[3] & 0x60000000U) >> 29U ) ;

    pCSD->WrSpeedFact = (uint8_t) ( (hmmc->CSD[3] & 0x1C000000U) >> 26U ) ;

    pCSD->MaxWrBlockLen = (uint8_t) ( (hmmc->CSD[3] & 0x03C00000U) >> 22U ) ;

    pCSD->WriteBlockPaPartial = (uint8_t) ( (hmmc->CSD[3] & 0x00200000U) >> 21U ) ;

    pCSD->Reserved3 = 0 ;

    pCSD->ContentProtectAppli = (uint8_t) ( (hmmc->CSD[3] & 0x00010000U) >> 16U ) ;

    pCSD->FileFormatGroup = (uint8_t) ( (hmmc->CSD[3] & 0x00008000U) >> 15U ) ;

    pCSD->CopyFlag = (uint8_t) ( (hmmc->CSD[3] & 0x00004000U) >> 14U ) ;

    pCSD->PermWrProtect = (uint8_t) ( (hmmc->CSD[3] & 0x00002000U) >> 13U ) ;

    pCSD->TempWrProtect = (uint8_t) ( (hmmc->CSD[3] & 0x00001000U) >> 12U ) ;

    pCSD->FileFormat = (uint8_t) ( (hmmc->CSD[3] & 0x00000C00U) >> 10U ) ;

    pCSD->ECC = (uint8_t) ( (hmmc->CSD[3] & 0x00000300U) >> 8U ) ;

    pCSD->CSD_CRC = (uint8_t) ( (hmmc->CSD[3] & 0x000000FEU) >> 1U ) ;

    pCSD->Reserved4 = 1 ;

    return HAL_OK ;
}

/**
  * @brief  Gets the MMC card info.
  * @param  hmmc: Pointer to MMC handle
  * @param  pCardInfo: Pointer to the HAL_MMC_CardInfoTypeDef structure that
  *         will contain the MMC card status information
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_GetCardInfo(
    MMC_HandleTypeDef * hmmc,
    HAL_MMC_CardInfoTypeDef * pCardInfo)
{
    pCardInfo->CardType = (uint32_t) (hmmc->MmcCard.CardType) ;
    pCardInfo->Class = (uint32_t) (hmmc->MmcCard.Class) ;
    pCardInfo->RelCardAdd = (uint32_t) (hmmc->MmcCard.RelCardAdd) ;
    pCardInfo->BlockNbr = (uint32_t) (hmmc->MmcCard.BlockNbr) ;
    pCardInfo->BlockSize = (uint32_t) (hmmc->MmcCard.BlockSize) ;
    pCardInfo->LogBlockNbr = (uint32_t) (hmmc->MmcCard.LogBlockNbr) ;
    pCardInfo->LogBlockSize = (uint32_t) (hmmc->MmcCard.LogBlockSize) ;

    return HAL_OK ;
}

/**
  * @brief  Returns information the information of the card which are stored on
  *         the Extended CSD register.
  * @param  hmmc Pointer to MMC handle
  * @param  pExtCSD Pointer to a memory area (512 bytes) that contains all
  *         Extended CSD register parameters
  * @param  Timeout Specify timeout value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_GetCardExtCSD(
    MMC_HandleTypeDef * hmmc,
    uint32_t * pExtCSD,
    uint32_t Timeout)
{
    SDMMC_DataInitTypeDef config ;
    uint32_t errorstate ;
    uint32_t tickstart = HAL_GetTick() ;
    uint32_t count ;
    uint32_t * tmp_buf ;

    if ( NULL == pExtCSD ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        return HAL_ERROR ;
    }

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

