mazent/STM32/Dispi/mmc/mz_hal_mmc.c
        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Initialize data control register */
        hmmc->Instance->DCTRL = 0 ;

        /* Initiaize the destination pointer */
        tmp_buf = pExtCSD ;

        /* Configure the MMC DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT ;
        config.DataLength = 512U ;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B ;
        config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC ;
        config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK ;
        config.DPSM = SDMMC_DPSM_DISABLE ;
        (void) SDMMC_ConfigData(hmmc->Instance, &config) ;
        __SDMMC_CMDTRANS_ENABLE(hmmc->Instance) ;

        /* Send ExtCSD Read command to Card */
        errorstate = SDMMC_CmdSendEXTCSD(hmmc->Instance, 0) ;
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* Poll on SDMMC flags */
        while ( !__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXOVERR
                                    | SDMMC_FLAG_DCRCFAIL
                                    | SDMMC_FLAG_DTIMEOUT
                                    | SDMMC_FLAG_DATAEND) ) {
            if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXFIFOHF) ) {
                /* Read data from SDMMC Rx FIFO */
                for ( count = 0U ; count < 8U ; count++ ) {
                    *tmp_buf = SDMMC_ReadFIFO(hmmc->Instance) ;
                    tmp_buf++ ;
                }
            }

            if ( ( (HAL_GetTick() - tickstart) >= Timeout ) ||
                 (Timeout == 0U) ) {
                /* Clear all the static flags */
                __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
                hmmc->ErrorCode |= HAL_MMC_ERROR_TIMEOUT ;
                hmmc->State = HAL_MMC_STATE_READY ;
                return HAL_TIMEOUT ;
            }
        }

        __SDMMC_CMDTRANS_DISABLE(hmmc->Instance) ;

        /* Get error state */
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DTIMEOUT) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_TIMEOUT ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }
        else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DCRCFAIL) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_CRC_FAIL ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }
        else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXOVERR) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_RX_OVERRUN ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }
        else {
            /* Nothing to do */
        }

        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;
        hmmc->State = HAL_MMC_STATE_READY ;
    }

    return HAL_OK ;
}

/**
  * @brief  Enables wide bus operation for the requested card if supported by
  *         card.
  * @param  hmmc: Pointer to MMC handle
  * @param  WideMode: Specifies the MMC card wide bus mode
  *          This parameter can be one of the following values:
  *            @arg SDMMC_BUS_WIDE_8B: 8-bit data transfer
  *            @arg SDMMC_BUS_WIDE_4B: 4-bit data transfer
  *            @arg SDMMC_BUS_WIDE_1B: 1-bit data transfer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_ConfigWideBusOperation(
    MMC_HandleTypeDef * hmmc,
    uint32_t WideMode)
{
    uint32_t count ;
    SDMMC_InitTypeDef Init ;
    uint32_t errorstate ;
    uint32_t response = 0U ;

    /* Check the parameters */
    assert_param( IS_SDMMC_BUS_WIDE(WideMode) ) ;

    /* Change State */
    hmmc->State = HAL_MMC_STATE_BUSY ;

    /* Check and update the power class if needed */
    if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_BUSSPEED) != 0U ) {
        if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_DDR) != 0U ) {
            errorstate = MMC_PwrClassUpdate(hmmc,
                                            WideMode,
                                            SDMMC_SPEED_MODE_DDR) ;
        }
        else {
            errorstate = MMC_PwrClassUpdate(hmmc,
                                            WideMode,
                                            SDMMC_SPEED_MODE_HIGH) ;
        }
    }
    else {
        errorstate = MMC_PwrClassUpdate(hmmc,
                                        WideMode,
                                        SDMMC_SPEED_MODE_DEFAULT) ;
    }

    if ( errorstate == HAL_MMC_ERROR_NONE ) {
        if ( WideMode == SDMMC_BUS_WIDE_8B ) {
            errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70200U) ;
        }
        else if ( WideMode == SDMMC_BUS_WIDE_4B ) {
            errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70100U) ;
        }
        else if ( WideMode == SDMMC_BUS_WIDE_1B ) {
            errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70000U) ;
        }
        else {
            /* WideMode is not a valid argument*/
            errorstate = HAL_MMC_ERROR_PARAM ;
        }

        /* Check for switch error and violation of the trial number of sending CMD 13 */
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
            count = SDMMC_MAX_TRIAL ;
            do {
                errorstate =
                    SDMMC_CmdSendStatus( hmmc->Instance,
                                         (uint32_t) ( ( (uint32_t) hmmc->
                                                        MmcCard.RelCardAdd )
                                                      << 16U ) ) ;
                if ( errorstate != HAL_MMC_ERROR_NONE ) {
                    break ;
                }

