mazent/STM32/Dispi/mmc/mz_hal_mmc.c
                /* Get command response */
                response = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
                count-- ;
            } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

            /* Check the status after the switch command execution */
            if ( (count != 0U) && (errorstate == HAL_MMC_ERROR_NONE) ) {
                /* Check the bit SWITCH_ERROR of the device status */
                if ( (response & 0x80U) != 0U ) {
                    errorstate = SDMMC_ERROR_GENERAL_UNKNOWN_ERR ;
                }
                else {
                    /* Configure the SDMMC peripheral */
                    Init = hmmc->Init ;
                    Init.BusWide = WideMode ;
                    (void) SDMMC_Init(hmmc->Instance, Init) ;
                }
            }
            else if ( count == 0U ) {
                errorstate = SDMMC_ERROR_TIMEOUT ;
            }
            else {
                /* Nothing to do */
            }
        }
    }

    /* Change State */
    hmmc->State = HAL_MMC_STATE_READY ;

    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= errorstate ;
        return HAL_ERROR ;
    }

    return HAL_OK ;
}

/**
  * @brief  Configure the speed bus mode
  * @param  hmmc: Pointer to the MMC handle
  * @param  SpeedMode: Specifies the MMC card speed bus mode
  *          This parameter can be one of the following values:
  *            @arg SDMMC_SPEED_MODE_AUTO: Max speed mode supported by the card
  *            @arg SDMMC_SPEED_MODE_DEFAULT: Default Speed (MMC @ 26MHz)
  *            @arg SDMMC_SPEED_MODE_HIGH: High Speed (MMC @ 52 MHz)
  *            @arg SDMMC_SPEED_MODE_DDR: High Speed DDR (MMC DDR @ 52 MHz)
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_MMC_ConfigSpeedBusOperation(
    MMC_HandleTypeDef * hmmc,
    uint32_t SpeedMode)
{
    uint32_t tickstart ;
    HAL_StatusTypeDef status = HAL_OK ;
    uint32_t device_type ;
    uint32_t errorstate ;

    /* Check the parameters */
    assert_param( IS_SDMMC_SPEED_MODE(SpeedMode) ) ;

    /* Change State */
    hmmc->State = HAL_MMC_STATE_BUSY ;

    /* Field DEVICE_TYPE [196 = 49*4] of Extended CSD register */
    device_type = (hmmc->Ext_CSD[49] & 0x000000FFU) ;

    switch ( SpeedMode ) {
    case SDMMC_SPEED_MODE_AUTO:
        if ( ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS) != 0U ) &&
             ( (device_type & 0x04U) != 0U ) ) {
            /* High Speed DDR mode allowed */
            errorstate = MMC_HighSpeed(hmmc, ENABLE) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                hmmc->ErrorCode |= errorstate ;
            }
            else {
                if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_CLKDIV) != 0U ) {
                    /* DDR mode not supported with CLKDIV = 0 */
                    errorstate = MMC_DDR_Mode(hmmc, ENABLE) ;
                    if ( errorstate != HAL_MMC_ERROR_NONE ) {
                        hmmc->ErrorCode |= errorstate ;
                    }
                }
            }
        }
        else if ( (device_type & 0x02U) != 0U ) {
            /* High Speed mode allowed */
            errorstate = MMC_HighSpeed(hmmc, ENABLE) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                hmmc->ErrorCode |= errorstate ;
            }
        }
        else {
            /* Nothing to do : keep current speed */
        }
        break ;
    case SDMMC_SPEED_MODE_DDR:
        if ( ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS) != 0U ) &&
             ( (device_type & 0x04U) != 0U ) ) {
            /* High Speed DDR mode allowed */
            errorstate = MMC_HighSpeed(hmmc, ENABLE) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                hmmc->ErrorCode |= errorstate ;
            }
            else {
                if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_CLKDIV) != 0U ) {
                    /* DDR mode not supported with CLKDIV = 0 */
                    errorstate = MMC_DDR_Mode(hmmc, ENABLE) ;
                    if ( errorstate != HAL_MMC_ERROR_NONE ) {
                        hmmc->ErrorCode |= errorstate ;
                    }
                }
            }
        }
        else {
            /* High Speed DDR mode not allowed */
            hmmc->ErrorCode |= HAL_MMC_ERROR_UNSUPPORTED_FEATURE ;
            status = HAL_ERROR ;
        }
        break ;
    case SDMMC_SPEED_MODE_HIGH:
        if ( (device_type & 0x02U) != 0U ) {
            /* High Speed mode allowed */
            errorstate = MMC_HighSpeed(hmmc, ENABLE) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                hmmc->ErrorCode |= errorstate ;
            }
        }
        else {
            /* High Speed mode not allowed */
            hmmc->ErrorCode |= HAL_MMC_ERROR_UNSUPPORTED_FEATURE ;
            status = HAL_ERROR ;
        }
        break ;
    case SDMMC_SPEED_MODE_DEFAULT:
        if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_DDR) != 0U ) {
            /* High Speed DDR mode activated */
            errorstate = MMC_DDR_Mode(hmmc, DISABLE) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                hmmc->ErrorCode |= errorstate ;
            }
        }
        if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_BUSSPEED) != 0U ) {
            /* High Speed mode activated */
            errorstate = MMC_HighSpeed(hmmc, DISABLE) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                hmmc->ErrorCode |= errorstate ;
            }
        }
        break ;
    default:
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        status = HAL_ERROR ;
        break ;
    }

    /* Verify that MMC card is ready to use after Speed mode switch*/
    tickstart = HAL_GetTick() ;
    while ( (HAL_MMC_GetCardState(hmmc) != HAL_MMC_CARD_TRANSFER) ) {
        if ( (HAL_GetTick() - tickstart) >= SDMMC_DATATIMEOUT ) {
            hmmc->ErrorCode = HAL_MMC_ERROR_TIMEOUT ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_TIMEOUT ;
        }
    }

