mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    /* Change State */
    hmmc->State = HAL_MMC_STATE_READY ;
    return status ;
}

/**
  * @brief  Gets the current mmc card data state.
  * @param  hmmc: pointer to MMC handle
  * @retval Card state
  */
HAL_MMC_CardStateTypeDef HAL_MMC_GetCardState(MMC_HandleTypeDef * hmmc)
{
    uint32_t cardstate ;
    uint32_t errorstate ;
    uint32_t resp1 = 0U ;

    errorstate = MMC_SendStatus(hmmc, &resp1) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        hmmc->ErrorCode |= errorstate ;
    }

    cardstate = ( (resp1 >> 9U) & 0x0FU ) ;

    return (HAL_MMC_CardStateTypeDef) cardstate ;
}

/**
  * @brief  Abort the current transfer and disable the MMC.
  * @param  hmmc: pointer to a MMC_HandleTypeDef structure that contains
  *                the configuration information for MMC module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_Abort(MMC_HandleTypeDef * hmmc)
{
    HAL_MMC_CardStateTypeDef CardState ;

    /* DIsable All interrupts */
    __HAL_MMC_DISABLE_IT(
        hmmc,
        SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL
        | SDMMC_IT_DTIMEOUT   \
        | SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR) ;

    /* Clear All flags */
    __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

    /* If IDMA Context, disable Internal DMA */
    hmmc->Instance->IDMACTRL = SDMMC_DISABLE_IDMA ;

    hmmc->State = HAL_MMC_STATE_READY ;

    /* Initialize the MMC operation */
    hmmc->Context = MMC_CONTEXT_NONE ;

    CardState = HAL_MMC_GetCardState(hmmc) ;
    if ( (CardState == HAL_MMC_CARD_RECEIVING) ||
         (CardState == HAL_MMC_CARD_SENDING) ) {
        hmmc->ErrorCode = SDMMC_CmdStopTransfer(hmmc->Instance) ;
    }
    if ( hmmc->ErrorCode != HAL_MMC_ERROR_NONE ) {
        return HAL_ERROR ;
    }
    return HAL_OK ;
}

/**
  * @brief  Abort the current transfer and disable the MMC (IT mode).
  * @param  hmmc: pointer to a MMC_HandleTypeDef structure that contains
  *                the configuration information for MMC module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_Abort_IT(MMC_HandleTypeDef * hmmc)
{
    HAL_MMC_CardStateTypeDef CardState ;

    /* DIsable All interrupts */
    __HAL_MMC_DISABLE_IT(
        hmmc,
        SDMMC_IT_DATAEND | SDMMC_IT_DCRCFAIL
        | SDMMC_IT_DTIMEOUT   \
        | SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR) ;

    /* If IDMA Context, disable Internal DMA */
    hmmc->Instance->IDMACTRL = SDMMC_DISABLE_IDMA ;

    /* Clear All flags */
    __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

    CardState = HAL_MMC_GetCardState(hmmc) ;
    hmmc->State = HAL_MMC_STATE_READY ;

    if ( (CardState == HAL_MMC_CARD_RECEIVING) ||
         (CardState == HAL_MMC_CARD_SENDING) ) {
        hmmc->ErrorCode = SDMMC_CmdStopTransfer(hmmc->Instance) ;
    }
    if ( hmmc->ErrorCode != HAL_MMC_ERROR_NONE ) {
        return HAL_ERROR ;
    }
    else {
#if defined (USE_HAL_MMC_REGISTER_CALLBACKS) && \
        (USE_HAL_MMC_REGISTER_CALLBACKS == 1U)
        hmmc->AbortCpltCallback(hmmc) ;
#else
        HAL_MMC_AbortCallback(hmmc) ;
#endif /* USE_HAL_MMC_REGISTER_CALLBACKS */
    }

    return HAL_OK ;
}

/**
  * @brief  Perform specific commands sequence for the different type of erase.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @param  hmmc Pointer to MMC handle
  * @param  EraseType Specifies the type of erase to be performed
  *          This parameter can be one of the following values:
  *             @arg HAL_MMC_TRIM Erase the write blocks identified by CMD35 & 36
  *             @arg HAL_MMC_ERASE Erase the erase groups identified by CMD35 & 36
  *             @arg HAL_MMC_DISCARD Discard the write blocks identified by CMD35 & 36
  *             @arg HAL_MMC_SECURE_ERASE Perform a secure purge according SRT on the erase groups identified
  *                  by CMD35 & 36
  *             @arg HAL_MMC_SECURE_TRIM_STEP1 Mark the write blocks identified by CMD35 & 36 for secure erase
  *             @arg HAL_MMC_SECURE_TRIM_STEP2 Perform a secure purge according SRT on the write blocks
  *                  previously identified
  * @param  BlockStartAdd Start Block address
  * @param  BlockEndAdd End Block address
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_EraseSequence(
    MMC_HandleTypeDef * hmmc,
    uint32_t EraseType,
    uint32_t BlockStartAdd,
    uint32_t BlockEndAdd)
{
    uint32_t errorstate ;
    uint32_t start_add = BlockStartAdd ;
    uint32_t end_add = BlockEndAdd ;
    uint32_t tickstart = HAL_GetTick() ;

    /* Check the erase type value is correct */
    assert_param( IS_MMC_ERASE_TYPE(EraseType) ) ;

    /* Check the coherence between start and end address */
    if ( end_add < start_add ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        return HAL_ERROR ;
    }

    /* Check that the end address is not out of range of device memory */
    if ( end_add > (hmmc->MmcCard.LogBlockNbr) ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_OUT_OF_RANGE ;
        return HAL_ERROR ;
    }

    /* Check the case of 4kB blocks (field DATA SECTOR SIZE of extended CSD register) */
    if ( ( (hmmc->Ext_CSD[(MMC_EXT_CSD_DATA_SEC_SIZE_INDEX
                           / 4)]
            >> MMC_EXT_CSD_DATA_SEC_SIZE_POS) & 0x000000FFU ) != 0x0U ) {
        if ( ( (start_add % 8U) != 0U ) || ( (end_add % 8U) != 0U ) ) {
            /* The address should be aligned to 8 (corresponding to 4 KBytes blocks) */
            hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_MISALIGNED ;
            return HAL_ERROR ;
        }
    }

    /* Check if the card command class supports erase command */
    if ( ( (hmmc->MmcCard.Class) & SDMMC_CCCC_ERASE ) == 0U ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_REQUEST_NOT_APPLICABLE ;
        return HAL_ERROR ;
    }

    /* Check the state of the driver */
    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        /* Change State */
        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Check that the card is not locked */
        if ( (SDMMC_GetResponse(hmmc->Instance,
                                SDMMC_RESP1) & SDMMC_CARD_LOCKED) ==
             SDMMC_CARD_LOCKED ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_LOCK_UNLOCK_FAILED ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_ERROR ;
        }

        /* In case of low capacity card, the address is not block number but bytes */
        if ( (hmmc->MmcCard.CardType) != MMC_HIGH_CAPACITY_CARD ) {
            start_add *= 512U ;
            end_add *= 512U ;
        }

