mazent/STM32/Dispi/mmc/mz_hal_mmc.c
        /* Send CMD35 MMC_ERASE_GRP_START with start address as argument */
        errorstate = SDMMC_CmdEraseStartAdd(hmmc->Instance, start_add) ;
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* Send CMD36 MMC_ERASE_GRP_END with end address as argument */
            errorstate = SDMMC_CmdEraseEndAdd(hmmc->Instance, end_add) ;
            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* Send CMD38 ERASE with erase type as argument */
                errorstate = SDMMC_CmdErase(hmmc->Instance, EraseType) ;
                if ( errorstate == HAL_MMC_ERROR_NONE ) {
                    if ( (EraseType == HAL_MMC_SECURE_ERASE) ||
                         (EraseType == HAL_MMC_SECURE_TRIM_STEP2) ) {
                        /* Wait that the device is ready by checking the D0 line */
                        while ( ( !__HAL_MMC_GET_FLAG(hmmc,
                                                      SDMMC_FLAG_BUSYD0END) )
                                &&
                                (errorstate == HAL_MMC_ERROR_NONE) ) {
                            if ( (HAL_GetTick() - tickstart) >=
                                 SDMMC_MAXERASETIMEOUT ) {
                                errorstate = HAL_MMC_ERROR_TIMEOUT ;
                            }
                        }

                        /* Clear the flag corresponding to end D0 bus line */
                        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_FLAG_BUSYD0END) ;
                    }
                }
            }
        }

        /* Change State */
        hmmc->State = HAL_MMC_STATE_READY ;

        /* Manage errors */
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;

            if ( errorstate != HAL_MMC_ERROR_TIMEOUT ) {
                return HAL_ERROR ;
            }
            else {
                return HAL_TIMEOUT ;
            }
        }
        else {
            return HAL_OK ;
        }
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Perform sanitize operation on the device.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @param  hmmc Pointer to MMC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_Sanitize(MMC_HandleTypeDef * hmmc)
{
    uint32_t errorstate ;
    uint32_t response = 0U ;
    uint32_t count ;
    uint32_t tickstart = HAL_GetTick() ;

    /* Check the state of the driver */
    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        /* Change State */
        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Index : 165 - Value : 0x01 */
        errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03A50100U) ;
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* Wait that the device is ready by checking the D0 line */
            while ( ( !__HAL_MMC_GET_FLAG(hmmc,
                                          SDMMC_FLAG_BUSYD0END) ) &&
                    (errorstate == HAL_MMC_ERROR_NONE) ) {
                if ( (HAL_GetTick() - tickstart) >= SDMMC_MAXERASETIMEOUT ) {
                    errorstate = HAL_MMC_ERROR_TIMEOUT ;
                }
            }

            /* Clear the flag corresponding to end D0 bus line */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_FLAG_BUSYD0END) ;

            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
                count = SDMMC_MAX_TRIAL ;
                do {
                    errorstate =
                        SDMMC_CmdSendStatus( hmmc->Instance,
                                             (uint32_t) ( ( (uint32_t) hmmc->
                                                            MmcCard.RelCardAdd )
                                                          << 16U ) ) ;
                    if ( errorstate != HAL_MMC_ERROR_NONE ) {
                        break ;
                    }

                    /* Get command response */
                    response = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
                    count-- ;
                } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

                /* Check the status after the switch command execution */
                if ( (count != 0U) && (errorstate == HAL_MMC_ERROR_NONE) ) {
                    /* Check the bit SWITCH_ERROR of the device status */
                    if ( (response & 0x80U) != 0U ) {
                        errorstate = SDMMC_ERROR_GENERAL_UNKNOWN_ERR ;
                    }
                }
                else if ( count == 0U ) {
                    errorstate = SDMMC_ERROR_TIMEOUT ;
                }
                else {
                    /* Nothing to do */
                }
            }
        }

        /* Change State */
        hmmc->State = HAL_MMC_STATE_READY ;

        /* Manage errors */
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;

            if ( errorstate != HAL_MMC_ERROR_TIMEOUT ) {
                return HAL_ERROR ;
            }
            else {
                return HAL_TIMEOUT ;
            }
        }
        else {
            return HAL_OK ;
        }
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Configure the Secure Removal Type (SRT) in the Extended CSD register.
  * @note   This API should be followed by a check on the card state through
  *         HAL_MMC_GetCardState().
  * @param  hmmc Pointer to MMC handle
  * @param  SRTMode Specifies the type of erase to be performed
  *          This parameter can be one of the following values:
  *            @arg HAL_MMC_SRT_ERASE Information removed by an erase
  *            @arg HAL_MMC_SRT_WRITE_CHAR_ERASE Information removed by an overwriting with a character
  *                 followed by an erase
  *            @arg HAL_MMC_SRT_WRITE_CHAR_COMPL_RANDOM Information removed by an overwriting with a character,
  *                 its complement then a random character
  *            @arg HAL_MMC_SRT_VENDOR_DEFINED Information removed using a vendor defined
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_ConfigSecRemovalType(
    MMC_HandleTypeDef * hmmc,
    uint32_t SRTMode)
{
    uint32_t srt ;
    uint32_t errorstate ;
    uint32_t response = 0U ;
    uint32_t count ;

    /* Check the erase type value is correct */
    assert_param( IS_MMC_SRT_TYPE(SRTMode) ) ;

    /* Check the state of the driver */
    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        /* Get the supported values by the device */
        if ( HAL_MMC_GetSupportedSecRemovalType(hmmc, &srt) == HAL_OK ) {
            /* Change State */
            hmmc->State = HAL_MMC_STATE_BUSY ;

            /* Check the value passed as parameter is supported by the device */
            if ( (SRTMode & srt) != 0U ) {
                /* Index : 16 - Value : SRTMode */
                srt |= ( ( POSITION_VAL(SRTMode) ) << 4U ) ;
                errorstate =
                    SDMMC_CmdSwitch( hmmc->Instance, ( 0x03100000U | (srt << 8U) ) ) ;
                if ( errorstate == HAL_MMC_ERROR_NONE ) {
                    /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
                    count = SDMMC_MAX_TRIAL ;
                    do {
                        errorstate =
                            SDMMC_CmdSendStatus( hmmc->Instance,
                                                 (uint32_t) ( ( (uint32_t) hmmc
                                                                ->MmcCard.
                                                                RelCardAdd )
                                                              << 16U ) ) ;
                        if ( errorstate != HAL_MMC_ERROR_NONE ) {
                            break ;
                        }

