mazent/STM32/Dispi/mmc/mz_hal_mmc.c
                        /* Get command response */
                        response = SDMMC_GetResponse(hmmc->Instance,
                                                     SDMMC_RESP1) ;
                        count-- ;
                    } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

                    /* Check the status after the switch command execution */
                    if ( (count != 0U) &&
                         (errorstate == HAL_MMC_ERROR_NONE) ) {
                        /* Check the bit SWITCH_ERROR of the device status */
                        if ( (response & 0x80U) != 0U ) {
                            errorstate = SDMMC_ERROR_GENERAL_UNKNOWN_ERR ;
                        }
                    }
                    else if ( count == 0U ) {
                        errorstate = SDMMC_ERROR_TIMEOUT ;
                    }
                    else {
                        /* Nothing to do */
                    }
                }
            }
            else {
                errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE ;
            }

            /* Change State */
            hmmc->State = HAL_MMC_STATE_READY ;
        }
        else {
            errorstate = SDMMC_ERROR_GENERAL_UNKNOWN_ERR ;
        }

        /* Manage errors */
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;
            return HAL_ERROR ;
        }
        else {
            return HAL_OK ;
        }
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Gets the supported values of the the Secure Removal Type (SRT).
  * @param  hmmc pointer to MMC handle
  * @param  SupportedSRT pointer for supported SRT value
  *          This parameter is a bit field of the following values:
  *            @arg HAL_MMC_SRT_ERASE Information removed by an erase
  *            @arg HAL_MMC_SRT_WRITE_CHAR_ERASE Information removed by an overwriting with a character followed
  *                  by an erase
  *            @arg HAL_MMC_SRT_WRITE_CHAR_COMPL_RANDOM Information removed by an overwriting with a character,
  *                 its complement then a random character
  *            @arg HAL_MMC_SRT_VENDOR_DEFINED Information removed using a vendor defined
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_GetSupportedSecRemovalType(
    MMC_HandleTypeDef * hmmc,
    uint32_t * SupportedSRT)
{
    /* Check the state of the driver */
    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        /* Change State */
        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Read field SECURE_REMOVAL_TYPE [16 = 4*4] of the Extended CSD register */
        *SupportedSRT = (hmmc->Ext_CSD[4] & 0x0000000FU) ; /* Bits [3:0] of field 16 */

        /* Change State */
        hmmc->State = HAL_MMC_STATE_READY ;

        return HAL_OK ;
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Switch the device from Standby State to Sleep State.
  * @param  hmmc pointer to MMC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_SleepDevice(MMC_HandleTypeDef * hmmc)
{
    uint32_t errorstate,
             sleep_timeout,
             timeout,
             count,
             response = 0U ;
    uint32_t tickstart = HAL_GetTick() ;

    /* Check the state of the driver */
    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        /* Change State */
        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Set the power-off notification to powered-on : Ext_CSD[34] = 1 */
        errorstate = SDMMC_CmdSwitch( hmmc->Instance, (0x03220100U) ) ;
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
            count = SDMMC_MAX_TRIAL ;
            do {
                errorstate =
                    SDMMC_CmdSendStatus( hmmc->Instance,
                                         (uint32_t) ( ( (uint32_t) hmmc->
                                                        MmcCard.RelCardAdd )
                                                      << 16U ) ) ;
                if ( errorstate != HAL_MMC_ERROR_NONE ) {
                    break ;
                }

                /* Get command response */
                response = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
                count-- ;
            } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

            /* Check the status after the switch command execution */
            if ( count == 0U ) {
                errorstate = SDMMC_ERROR_TIMEOUT ;
            }
            else if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* Check the bit SWITCH_ERROR of the device status */
                if ( (response & 0x80U) != 0U ) {
                    errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE ;
                }
                else {
                    /* Set the power-off notification to sleep notification : Ext_CSD[34] = 4 */
                    errorstate = SDMMC_CmdSwitch( hmmc->Instance, (0x03220400U) ) ;
                    if ( errorstate == HAL_MMC_ERROR_NONE ) {
                        /* Field SLEEP_NOTIFICATION_TIME [216] */
                        sleep_timeout =
                            ( (hmmc->Ext_CSD[(
                                                 MMC_EXT_CSD_SLEEP_NOTIFICATION_TIME_INDEX
                                                 / 4)]
                               >>
                               MMC_EXT_CSD_SLEEP_NOTIFICATION_TIME_POS)
                              & 0x000000FFU ) ;

                        /* Sleep/Awake Timeout = 10us * 2^SLEEP_NOTIFICATION_TIME */
                        /* In HAL, the tick interrupt occurs each ms */
                        if ( (sleep_timeout == 0U) ||
                             (sleep_timeout > 0x17U) ) {
                            sleep_timeout = 0x17U ; /* Max register value defined is 0x17 */
                        }
                        timeout = ( ( (1UL << sleep_timeout) / 100U ) + 1U ) ;

                        /* Wait that the device is ready by checking the D0 line */
                        while ( ( !__HAL_MMC_GET_FLAG(hmmc,
                                                      SDMMC_FLAG_BUSYD0END) )
                                &&
                                (errorstate == HAL_MMC_ERROR_NONE) ) {
                            if ( (HAL_GetTick() - tickstart) >= timeout ) {
                                errorstate = SDMMC_ERROR_TIMEOUT ;
                            }
                        }

                        /* Clear the flag corresponding to end D0 bus line */
                        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_FLAG_BUSYD0END) ;

                        if ( errorstate == HAL_MMC_ERROR_NONE ) {
                            /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
                            count = SDMMC_MAX_TRIAL ;
                            do {
                                errorstate = SDMMC_CmdSendStatus(
                                     hmmc->Instance,
                                    (uint32_t) ( ( (
                                                       uint32_t) hmmc->MmcCard.
                                                   RelCardAdd ) << 16U ) ) ;
                                if ( errorstate != HAL_MMC_ERROR_NONE ) {
                                    break ;
                                }

