mazent/STM32/Dispi/mmc/mz_hal_mmc.c
                                /* Get command response */
                                response = SDMMC_GetResponse(hmmc->Instance,
                                                             SDMMC_RESP1) ;
                                count-- ;
                            } while ( ( (response & 0x100U) == 0U ) &&
                                      (count != 0U) ) ;

                            /* Check the status after the switch command execution */
                            if ( count == 0U ) {
                                errorstate = SDMMC_ERROR_TIMEOUT ;
                            }
                            else if ( errorstate == HAL_MMC_ERROR_NONE ) {
                                /* Check the bit SWITCH_ERROR of the device status */
                                if ( (response & 0x80U) != 0U ) {
                                    errorstate =
                                        SDMMC_ERROR_UNSUPPORTED_FEATURE ;
                                }
                                else {
                                    /* Switch the device in stand-by mode */
                                    (void) SDMMC_CmdSelDesel(hmmc->Instance, 0U) ;

                                    /* Field S_A_TIEMOUT [217] */
                                    sleep_timeout =
                                        ( (hmmc->Ext_CSD[(
                                                             MMC_EXT_CSD_S_A_TIMEOUT_INDEX
                                                             / 4)]
                                           >>
                                           MMC_EXT_CSD_S_A_TIMEOUT_POS)
                                          & 0x000000FFU ) ;

                                    /* Sleep/Awake Timeout = 100ns * 2^S_A_TIMEOUT */
                                    /* In HAL, the tick interrupt occurs each ms */
                                    if ( (sleep_timeout == 0U) ||
                                         (sleep_timeout > 0x17U) ) {
                                        sleep_timeout = 0x17U ; /* Max register value defined is 0x17 */
                                    }
                                    timeout =
                                        ( ( (1UL
                                             << sleep_timeout) / 10000U ) + 1U ) ;

                                    if ( HAL_MMC_GetCardState(hmmc) ==
                                         HAL_MMC_CARD_STANDBY ) {
                                        /* Send CMD5 CMD_MMC_SLEEP_AWAKE with RCA and SLEEP as argument */
                                        errorstate = SDMMC_CmdSleepMmc(
                                             hmmc->Instance,
                                            ( (hmmc
                                               ->MmcCard.RelCardAdd
                                               << 16U) | (0x1U << 15U) ) ) ;
                                        if ( errorstate ==
                                             HAL_MMC_ERROR_NONE ) {
                                            /* Wait that the device is ready by checking the D0 line */
                                            while ( ( !__HAL_MMC_GET_FLAG(hmmc,
                                                                          SDMMC_FLAG_BUSYD0END) )
                                                    &&
                                                    (errorstate ==
                                                     HAL_MMC_ERROR_NONE) ) {
                                                if ( (HAL_GetTick()
                                                      - tickstart) >=
                                                     timeout ) {
                                                    errorstate =
                                                        SDMMC_ERROR_TIMEOUT ;
                                                }
                                            }

                                            /* Clear the flag corresponding to end D0 bus line */
                                            __HAL_MMC_CLEAR_FLAG(
                                                hmmc,
                                                SDMMC_FLAG_BUSYD0END) ;
                                        }
                                    }
                                    else {
                                        errorstate =
                                            SDMMC_ERROR_REQUEST_NOT_APPLICABLE ;
                                    }
                                }
                            }
                            else {
                                /* Nothing to do */
                            }
                        }
                    }
                }
            }
            else {
                /* Nothing to do */
            }
        }

        /* Change State */
        hmmc->State = HAL_MMC_STATE_READY ;

        /* Manage errors */
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;

            if ( errorstate != HAL_MMC_ERROR_TIMEOUT ) {
                return HAL_ERROR ;
            }
            else {
                return HAL_TIMEOUT ;
            }
        }
        else {
            return HAL_OK ;
        }
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @brief  Switch the device from Sleep State to Standby State.
  * @param  hmmc pointer to MMC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_MMC_AwakeDevice(MMC_HandleTypeDef * hmmc)
{
    uint32_t errorstate ;
    uint32_t sleep_timeout ;
    uint32_t timeout ;
    uint32_t count ;
    uint32_t response = 0U ;
    uint32_t tickstart = HAL_GetTick() ;

    /* Check the state of the driver */
    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        /* Change State */
        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Field S_A_TIEMOUT [217] */
        sleep_timeout =
            ( (hmmc->Ext_CSD[(MMC_EXT_CSD_S_A_TIMEOUT_INDEX
                              / 4)] >> MMC_EXT_CSD_S_A_TIMEOUT_POS)
              & 0x000000FFU ) ;

