mazent/STM32/Dispi/mmc/mz_hal_mmc.c
        /* Sleep/Awake Timeout = 100ns * 2^S_A_TIMEOUT */
        /* In HAL, the tick interrupt occurs each ms */
        if ( (sleep_timeout == 0U) || (sleep_timeout > 0x17U) ) {
            sleep_timeout = 0x17U ; /* Max register value defined is 0x17 */
        }
        timeout = ( ( (1UL << sleep_timeout) / 10000U ) + 1U ) ;

        /* Send CMD5 CMD_MMC_SLEEP_AWAKE with RCA and AWAKE as argument */
        errorstate =
            SDMMC_CmdSleepMmc( hmmc->Instance, (hmmc->MmcCard.RelCardAdd << 16U) ) ;
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* Wait that the device is ready by checking the D0 line */
            while ( ( !__HAL_MMC_GET_FLAG(hmmc,
                                          SDMMC_FLAG_BUSYD0END) ) &&
                    (errorstate == HAL_MMC_ERROR_NONE) ) {
                if ( (HAL_GetTick() - tickstart) >= timeout ) {
                    errorstate = SDMMC_ERROR_TIMEOUT ;
                }
            }

            /* Clear the flag corresponding to end D0 bus line */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_FLAG_BUSYD0END) ;

            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                if ( HAL_MMC_GetCardState(hmmc) == HAL_MMC_CARD_STANDBY ) {
                    /* Switch the device in transfer mode */
                    errorstate =
                        SDMMC_CmdSelDesel( hmmc->Instance,
                                           (hmmc->MmcCard.RelCardAdd << 16U) ) ;
                    if ( errorstate == HAL_MMC_ERROR_NONE ) {
                        if ( HAL_MMC_GetCardState(hmmc) ==
                             HAL_MMC_CARD_TRANSFER ) {
                            /* Set the power-off notification to powered-on : Ext_CSD[34] = 1 */
                            errorstate =
                                SDMMC_CmdSwitch( hmmc->Instance, (0x03220100U) ) ;
                            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                                /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
                                count = SDMMC_MAX_TRIAL ;
                                do {
                                    errorstate = SDMMC_CmdSendStatus(
                                         hmmc->Instance,
                                        (uint32_t) ( ( (
                                                           uint32_t) hmmc->
                                                       MmcCard.RelCardAdd )
                                                     << 16U ) ) ;
                                    if ( errorstate != HAL_MMC_ERROR_NONE ) {
                                        break ;
                                    }

                                    /* Get command response */
                                    response = SDMMC_GetResponse(hmmc->Instance,
                                                                 SDMMC_RESP1) ;
                                    count-- ;
                                } while ( ( (response & 0x100U) == 0U ) &&
                                          (count != 0U) ) ;

                                /* Check the status after the switch command execution */
                                if ( count == 0U ) {
                                    errorstate = SDMMC_ERROR_TIMEOUT ;
                                }
                                else if ( errorstate == HAL_MMC_ERROR_NONE ) {
                                    /* Check the bit SWITCH_ERROR of the device status */
                                    if ( (response & 0x80U) != 0U ) {
                                        errorstate =
                                            SDMMC_ERROR_UNSUPPORTED_FEATURE ;
                                    }
                                }
                                else {
                                    /* NOthing to do */
                                }
                            }
                        }
                        else {
                            errorstate = SDMMC_ERROR_REQUEST_NOT_APPLICABLE ;
                        }
                    }
                }
                else {
                    errorstate = SDMMC_ERROR_REQUEST_NOT_APPLICABLE ;
                }
            }
        }

        /* Change State */
        hmmc->State = HAL_MMC_STATE_READY ;

        /* Manage errors */
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= errorstate ;

            if ( errorstate != HAL_MMC_ERROR_TIMEOUT ) {
                return HAL_ERROR ;
            }
            else {
                return HAL_TIMEOUT ;
            }
        }
        else {
            return HAL_OK ;
        }
    }
    else {
        return HAL_BUSY ;
    }
}

/**
  * @}
  */

/**
  * @}
  */

/* Private function ----------------------------------------------------------*/
/** @addtogroup MMC_Private_Functions
  * @{
  */

/**
  * @brief  Initializes the mmc card.
  * @param  hmmc: Pointer to MMC handle
  * @retval MMC Card error state
  */
static uint32_t MMC_InitCard(MMC_HandleTypeDef * hmmc)
{
    HAL_MMC_CardCSDTypeDef CSD ;
    uint32_t errorstate ;
    uint16_t mmc_rca = 2U ;
    MMC_InitTypeDef Init ;

    /* Check the power State */
    if ( SDMMC_GetPowerState(hmmc->Instance) == 0U ) {
        /* Power off */
        return HAL_MMC_ERROR_REQUEST_NOT_APPLICABLE ;
    }

    /* Send CMD2 ALL_SEND_CID */
    errorstate = SDMMC_CmdSendCID(hmmc->Instance) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        return errorstate ;
    }
    else {
        /* Get Card identification number data */
        hmmc->CID[0U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
        hmmc->CID[1U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP2) ;
        hmmc->CID[2U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP3) ;
        hmmc->CID[3U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP4) ;
    }

