mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    /* Send CMD3 SET_REL_ADDR with RCA = 2 (should be greater than 1) */
    /* MMC Card publishes its RCA. */
    errorstate = SDMMC_CmdSetRelAddMmc(hmmc->Instance, mmc_rca) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        return errorstate ;
    }

    /* Get the MMC card RCA */
    hmmc->MmcCard.RelCardAdd = mmc_rca ;

    /* Send CMD9 SEND_CSD with argument as card's RCA */
    errorstate =
        SDMMC_CmdSendCSD( hmmc->Instance,
                          (uint32_t) (hmmc->MmcCard.RelCardAdd << 16U) ) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        return errorstate ;
    }
    else {
        /* Get Card Specific Data */
        hmmc->CSD[0U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
        hmmc->CSD[1U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP2) ;
        hmmc->CSD[2U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP3) ;
        hmmc->CSD[3U] = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP4) ;
    }

    /* Get the Card Class */
    hmmc->MmcCard.Class =
        (SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP2) >> 20U) ;

    /* Select the Card */
    errorstate =
        SDMMC_CmdSelDesel( hmmc->Instance,
                           (uint32_t) ( ( (uint32_t) hmmc->MmcCard.RelCardAdd )
                                        << 16U ) ) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        return errorstate ;
    }

    /* Get CSD parameters */
    if ( HAL_MMC_GetCardCSD(hmmc, &CSD) != HAL_OK ) {
        return hmmc->ErrorCode ;
    }

    /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
    errorstate =
        SDMMC_CmdSendStatus( hmmc->Instance,
                             (uint32_t) ( ( (uint32_t) hmmc->MmcCard.RelCardAdd )
                                          << 16U ) ) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        hmmc->ErrorCode |= errorstate ;
    }

    /* Get Extended CSD parameters */
    if ( HAL_MMC_GetCardExtCSD(hmmc, hmmc->Ext_CSD,
                               SDMMC_DATATIMEOUT) != HAL_OK ) {
        return hmmc->ErrorCode ;
    }

    /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
    errorstate =
        SDMMC_CmdSendStatus( hmmc->Instance,
                             (uint32_t) ( ( (uint32_t) hmmc->MmcCard.RelCardAdd )
                                          << 16U ) ) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        hmmc->ErrorCode |= errorstate ;
    }

    /* Configure the SDMMC peripheral */
    Init = hmmc->Init ;
    Init.BusWide = SDMMC_BUS_WIDE_1B ;
    (void) SDMMC_Init(hmmc->Instance, Init) ;

    /* All cards are initialized */
    return HAL_MMC_ERROR_NONE ;
}

/**
  * @brief  Enquires cards about their operating voltage and configures clock
  *         controls and stores MMC information that will be needed in future
  *         in the MMC handle.
  * @param  hmmc: Pointer to MMC handle
  * @retval error state
  */
static uint32_t MMC_PowerON(MMC_HandleTypeDef * hmmc)
{
    __IO uint32_t count = 0U ;
    uint32_t response = 0U ;
    uint32_t validvoltage = 0U ;
    uint32_t errorstate ;

    /* CMD0: GO_IDLE_STATE */
    errorstate = SDMMC_CmdGoIdleState(hmmc->Instance) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        return errorstate ;
    }

    while ( validvoltage == 0U ) {
        if ( count++ == SDMMC_MAX_VOLT_TRIAL ) {
            return HAL_MMC_ERROR_INVALID_VOLTRANGE ;
        }

        /* SEND CMD1 APP_CMD with voltage range as argument */
        errorstate = SDMMC_CmdOpCondition(hmmc->Instance, MMC_VOLTAGE_RANGE) ;
        if ( errorstate != HAL_MMC_ERROR_NONE ) {
            return HAL_MMC_ERROR_UNSUPPORTED_FEATURE ;
        }

        /* Get command response */
        response = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;

        /* Get operating voltage*/
        validvoltage = ( ( (response >> 31U) == 1U ) ? 1U : 0U ) ;
    }

    /* When power routine is finished and command returns valid voltage */
    if ( ( ( response & (0xFF000000U) ) >> 24 ) == 0xC0U ) {
        hmmc->MmcCard.CardType = MMC_HIGH_CAPACITY_CARD ;
    }
    else {
        hmmc->MmcCard.CardType = MMC_LOW_CAPACITY_CARD ;
    }

    return HAL_MMC_ERROR_NONE ;
}

/**
  * @brief  Turns the SDMMC output signals off.
  * @param  hmmc: Pointer to MMC handle
  * @retval None
  */
static void MMC_PowerOFF(MMC_HandleTypeDef * hmmc)
{
    /* Set Power State to OFF */
    (void) SDMMC_PowerState_OFF(hmmc->Instance) ;
}

/**
  * @brief  Returns the current card's status.
  * @param  hmmc: Pointer to MMC handle
  * @param  pCardStatus: pointer to the buffer that will contain the MMC card
  *         status (Card Status register)
  * @retval error state
  */
static uint32_t MMC_SendStatus(
    MMC_HandleTypeDef * hmmc,
    uint32_t * pCardStatus)
{
    uint32_t errorstate ;

    if ( pCardStatus == NULL ) {
        return HAL_MMC_ERROR_PARAM ;
    }

    /* Send Status command */
    errorstate =
        SDMMC_CmdSendStatus( hmmc->Instance,
                             (uint32_t) (hmmc->MmcCard.RelCardAdd << 16U) ) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        return errorstate ;
    }

    /* Get MMC card status */
    *pCardStatus = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;

    return HAL_MMC_ERROR_NONE ;
}

/**
  * @brief  Reads extended CSD register to get the sectors number of the device
  * @param  hmmc: Pointer to MMC handle
  * @param  pFieldData: Pointer to the read buffer
  * @param  FieldIndex: Index of the field to be read
  * @param  Timeout: Specify timeout value
  * @retval HAL status
  */
static HAL_StatusTypeDef MMC_ReadExtCSD(
    MMC_HandleTypeDef * hmmc,
    uint32_t * pFieldData,
    uint16_t FieldIndex,
    uint32_t Timeout)
{
    SDMMC_DataInitTypeDef config ;
    uint32_t errorstate ;
    uint32_t tickstart = HAL_GetTick() ;
    uint32_t count ;
    uint32_t i = 0 ;
    uint32_t tmp_data ;

    hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

    /* Initialize data control register */
    hmmc->Instance->DCTRL = 0 ;

    /* Configure the MMC DPSM (Data Path State Machine) */
    config.DataTimeOut = SDMMC_DATATIMEOUT ;
    config.DataLength = 512U ;
    config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B ;
    config.TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC ;
    config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK ;
    config.DPSM = SDMMC_DPSM_ENABLE ;
    (void) SDMMC_ConfigData(hmmc->Instance, &config) ;

    /* Set Block Size for Card */
    errorstate = SDMMC_CmdSendEXTCSD(hmmc->Instance, 0) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= errorstate ;
        hmmc->State = HAL_MMC_STATE_READY ;
        return HAL_ERROR ;
    }

    /* Poll on SDMMC flags */
    while ( !__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXOVERR
                                | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT
                                | SDMMC_FLAG_DATAEND) ) {
        if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXFIFOHF) ) {
            /* Read data from SDMMC Rx FIFO */
            for ( count = 0U ; count < 8U ; count++ ) {
                tmp_data = SDMMC_ReadFIFO(hmmc->Instance) ;
                /* eg : SEC_COUNT   : FieldIndex = 212 => i+count = 53 */
                /*      DEVICE_TYPE : FieldIndex = 196 => i+count = 49 */
                if ( (i + count) == ( (uint32_t) FieldIndex / 4U ) ) {
                    *pFieldData = tmp_data ;
                }
            }
            i += 8U ;
        }

        if ( ( (HAL_GetTick() - tickstart) >= Timeout ) || (Timeout == 0U) ) {
            /* Clear all the static flags */
            __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
            hmmc->ErrorCode |= HAL_MMC_ERROR_TIMEOUT ;
            hmmc->State = HAL_MMC_STATE_READY ;
            return HAL_TIMEOUT ;
        }
    }

    /* Get error state */
    if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DTIMEOUT) ) {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_TIMEOUT ;
        hmmc->State = HAL_MMC_STATE_READY ;
        return HAL_ERROR ;
    }
    else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DCRCFAIL) ) {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_CRC_FAIL ;
        hmmc->State = HAL_MMC_STATE_READY ;
        return HAL_ERROR ;
    }
    else if ( __HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXOVERR) ) {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS) ;
        hmmc->ErrorCode |= HAL_MMC_ERROR_RX_OVERRUN ;
        hmmc->State = HAL_MMC_STATE_READY ;
        return HAL_ERROR ;
    }
    else {
        /* Nothing to do */
    }

