mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
    errorstate =
        SDMMC_CmdSendStatus( hmmc->Instance,
                             (uint32_t) ( ( (uint32_t) hmmc->MmcCard.RelCardAdd )
                                          << 16 ) ) ;
    if ( errorstate != HAL_MMC_ERROR_NONE ) {
        hmmc->ErrorCode |= errorstate ;
    }

    /* Clear all the static flags */
    __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS) ;

    hmmc->State = HAL_MMC_STATE_READY ;

    return HAL_OK ;
}

/**
  * @brief  Wrap up reading in non-blocking mode.
  * @param  hmmc: pointer to a MMC_HandleTypeDef structure that contains
  *              the configuration information.
  * @retval None
  */
static void MMC_Read_IT(MMC_HandleTypeDef * hmmc)
{
    uint32_t count ;
    uint32_t data ;
    uint8_t * tmp ;

    tmp = hmmc->pRxBuffPtr ;

    if ( hmmc->RxXferSize >= 32U ) {
        /* Read data from SDMMC Rx FIFO */
        for ( count = 0U ; count < 8U ; count++ ) {
            data = SDMMC_ReadFIFO(hmmc->Instance) ;
            *tmp = (uint8_t) (data & 0xFFU) ;
            tmp++ ;
            *tmp = (uint8_t) ( (data >> 8U) & 0xFFU ) ;
            tmp++ ;
            *tmp = (uint8_t) ( (data >> 16U) & 0xFFU ) ;
            tmp++ ;
            *tmp = (uint8_t) ( (data >> 24U) & 0xFFU ) ;
            tmp++ ;
        }

        hmmc->pRxBuffPtr = tmp ;
        hmmc->RxXferSize -= 32U ;
    }
}

/**
  * @brief  Wrap up writing in non-blocking mode.
  * @param  hmmc: pointer to a MMC_HandleTypeDef structure that contains
  *              the configuration information.
  * @retval None
  */
static void MMC_Write_IT(MMC_HandleTypeDef * hmmc)
{
    uint32_t count ;
    uint32_t data ;
    uint8_t * tmp = hmmc->pTxBuffPtr ;

    if ( hmmc->TxXferSize >= 32U ) {
        /* Write data to SDMMC Tx FIFO */
        for ( count = 0U ; count < 8U ; count++ ) {
            data = (uint32_t) (*tmp) ;
            tmp++ ;
            data |= ( (uint32_t) (*tmp) << 8U ) ;
            tmp++ ;
            data |= ( (uint32_t) (*tmp) << 16U ) ;
            tmp++ ;
            data |= ( (uint32_t) (*tmp) << 24U ) ;
            tmp++ ;
            (void) SDMMC_WriteFIFO(hmmc->Instance, &data) ;
        }

        hmmc->pTxBuffPtr = tmp ;
        hmmc->TxXferSize -= 32U ;
    }
}

/**
  * @brief  Switches the MMC card to high speed mode.
  * @param  hmmc: MMC handle
  * @param  state: State of high speed mode
  * @retval MMC Card error state
  */
static uint32_t MMC_HighSpeed(
    MMC_HandleTypeDef * hmmc,
    FunctionalState state)
{
    uint32_t errorstate = HAL_MMC_ERROR_NONE ;
    uint32_t response = 0U ;
    uint32_t count ;
    uint32_t sdmmc_clk ;
    SDMMC_InitTypeDef Init ;

    if ( ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_BUSSPEED) != 0U ) &&
         (state == DISABLE) ) {
        errorstate =
            MMC_PwrClassUpdate(hmmc,
                               (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS),
                               SDMMC_SPEED_MODE_DEFAULT) ;
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* Index : 185 - Value : 0 */
            errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B90000U) ;
        }
    }

    if ( ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_BUSSPEED) == 0U ) &&
         (state != DISABLE) ) {
        errorstate =
            MMC_PwrClassUpdate(hmmc,
                               (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS),
                               SDMMC_SPEED_MODE_HIGH) ;
        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            /* Index : 185 - Value : 1 */
            errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B90100U) ;
        }
    }

    if ( errorstate == HAL_MMC_ERROR_NONE ) {
        /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
        count = SDMMC_MAX_TRIAL ;
        do {
            errorstate =
                SDMMC_CmdSendStatus( hmmc->Instance,
                                     (uint32_t) ( ( (uint32_t) hmmc->MmcCard.
                                                    RelCardAdd ) << 16U ) ) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                break ;
            }

            /* Get command response */
            response = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
            count-- ;
        } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

        /* Check the status after the switch command execution */
        if ( (count != 0U) && (errorstate == HAL_MMC_ERROR_NONE) ) {
            /* Check the bit SWITCH_ERROR of the device status */
            if ( (response & 0x80U) != 0U ) {
                errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE ;
            }
            else {
                /* Configure high speed */
                Init.ClockEdge = hmmc->Init.ClockEdge ;
                Init.ClockPowerSave = hmmc->Init.ClockPowerSave ;
                Init.BusWide = (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS) ;
                Init.HardwareFlowControl = hmmc->Init.HardwareFlowControl ;

                if ( state == DISABLE ) {
                    Init.ClockDiv = hmmc->Init.ClockDiv ;
                    (void) SDMMC_Init(hmmc->Instance, Init) ;

                    CLEAR_BIT(hmmc->Instance->CLKCR, SDMMC_CLKCR_BUSSPEED) ;
                }
                else {
                    /* High Speed Clock should be less or equal to 52MHz*/
                    sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC) ;

                    if ( sdmmc_clk == 0U ) {
                        errorstate = SDMMC_ERROR_INVALID_PARAMETER ;
                    }
                    else {
                        if ( sdmmc_clk <= MMC_HIGH_SPEED_FREQ ) {
                            Init.ClockDiv = 0 ;
                        }
                        else {
                            Init.ClockDiv =
                                ( sdmmc_clk / (2U * MMC_HIGH_SPEED_FREQ) ) + 1U ;
                        }
                        (void) SDMMC_Init(hmmc->Instance, Init) ;

                        SET_BIT(hmmc->Instance->CLKCR, SDMMC_CLKCR_BUSSPEED) ;
                    }
                }
            }
        }
        else if ( count == 0U ) {
            errorstate = SDMMC_ERROR_TIMEOUT ;
        }
        else {
            /* Nothing to do */
        }
    }

