mazent/STM32/Dispi/mmc/mz_hal_mmc.c
    return errorstate ;
}

/**
  * @brief  Switches the MMC card to Double Data Rate (DDR) mode.
  * @param  hmmc: MMC handle
  * @param  state: State of DDR mode
  * @retval MMC Card error state
  */
static uint32_t MMC_DDR_Mode(
    MMC_HandleTypeDef * hmmc,
    FunctionalState state)
{
    uint32_t errorstate = HAL_MMC_ERROR_NONE ;
    uint32_t response = 0U ;
    uint32_t count ;

    if ( ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_DDR) != 0U ) &&
         (state == DISABLE) ) {
        if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS_0) != 0U ) {
            errorstate = MMC_PwrClassUpdate(hmmc,
                                            SDMMC_BUS_WIDE_4B,
                                            SDMMC_SPEED_MODE_HIGH) ;
            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* Index : 183 - Value : 1 */
                errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70100U) ;
            }
        }
        else {
            errorstate = MMC_PwrClassUpdate(hmmc,
                                            SDMMC_BUS_WIDE_8B,
                                            SDMMC_SPEED_MODE_HIGH) ;
            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* Index : 183 - Value : 2 */
                errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70200U) ;
            }
        }
    }

    if ( ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_DDR) == 0U ) &&
         (state != DISABLE) ) {
        if ( (hmmc->Instance->CLKCR & SDMMC_CLKCR_WIDBUS_0) != 0U ) {
            errorstate = MMC_PwrClassUpdate(hmmc,
                                            SDMMC_BUS_WIDE_4B,
                                            SDMMC_SPEED_MODE_DDR) ;
            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* Index : 183 - Value : 5 */
                errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70500U) ;
            }
        }
        else {
            errorstate = MMC_PwrClassUpdate(hmmc,
                                            SDMMC_BUS_WIDE_8B,
                                            SDMMC_SPEED_MODE_DDR) ;
            if ( errorstate == HAL_MMC_ERROR_NONE ) {
                /* Index : 183 - Value : 6 */
                errorstate = SDMMC_CmdSwitch(hmmc->Instance, 0x03B70600U) ;
            }
        }
    }

    if ( errorstate == HAL_MMC_ERROR_NONE ) {
        /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
        count = SDMMC_MAX_TRIAL ;
        do {
            errorstate =
                SDMMC_CmdSendStatus( hmmc->Instance,
                                     (uint32_t) ( ( (uint32_t) hmmc->MmcCard.
                                                    RelCardAdd ) << 16U ) ) ;
            if ( errorstate != HAL_MMC_ERROR_NONE ) {
                break ;
            }

            /* Get command response */
            response = SDMMC_GetResponse(hmmc->Instance, SDMMC_RESP1) ;
            count-- ;
        } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

        /* Check the status after the switch command execution */
        if ( (count != 0U) && (errorstate == HAL_MMC_ERROR_NONE) ) {
            /* Check the bit SWITCH_ERROR of the device status */
            if ( (response & 0x80U) != 0U ) {
                errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE ;
            }
            else {
                /* Configure DDR mode */
                if ( state == DISABLE ) {
                    CLEAR_BIT(hmmc->Instance->CLKCR, SDMMC_CLKCR_DDR) ;
                }
                else {
                    SET_BIT(hmmc->Instance->CLKCR, SDMMC_CLKCR_DDR) ;
                }
            }
        }
        else if ( count == 0U ) {
            errorstate = SDMMC_ERROR_TIMEOUT ;
        }
        else {
            /* Nothing to do */
        }
    }

    return errorstate ;
}

/**
  * @brief  Update the power class of the device.
  * @param  hmmc MMC handle
  * @param  Wide Wide of MMC bus
  * @param  Speed Speed of the MMC bus
  * @retval MMC Card error state
  */
static uint32_t MMC_PwrClassUpdate(
    MMC_HandleTypeDef * hmmc,
    uint32_t Wide,
    uint32_t Speed)
{
    uint32_t count ;
    uint32_t response = 0U ;
    uint32_t errorstate = HAL_MMC_ERROR_NONE ;
    uint32_t power_class ;
    uint32_t supported_pwr_class ;

    if ( (Wide == SDMMC_BUS_WIDE_8B) || (Wide == SDMMC_BUS_WIDE_4B) ) {
        power_class = 0U ; /* Default value after power-on or software reset */

        /* Read the PowerClass field of the Extended CSD register */
        if ( MMC_ReadExtCSD(hmmc, &power_class, 187,
                            SDMMC_DATATIMEOUT) != HAL_OK ) {                  /* Field POWER_CLASS [187] */
            errorstate = SDMMC_ERROR_GENERAL_UNKNOWN_ERR ;
        }
        else {
            power_class = ( (power_class >> 24U) & 0x000000FFU ) ;
        }

        /* Get the supported PowerClass field of the Extended CSD register */
        if ( Speed == SDMMC_SPEED_MODE_DDR ) {
            /* Field PWR_CL_DDR_52_xxx [238 or 239] */
            supported_pwr_class =
                ( (hmmc->Ext_CSD[(MMC_EXT_CSD_PWR_CL_DDR_52_INDEX
                                  / 4)] >> MMC_EXT_CSD_PWR_CL_DDR_52_POS)
                  & 0x000000FFU ) ;
        }
        else if ( Speed == SDMMC_SPEED_MODE_HIGH ) {
            /* Field PWR_CL_52_xxx [200 or 202] */
            supported_pwr_class =
                ( (hmmc->Ext_CSD[(MMC_EXT_CSD_PWR_CL_52_INDEX
                                  / 4)] >> MMC_EXT_CSD_PWR_CL_52_POS)
                  & 0x000000FFU ) ;
        }
        else {
            /* Field PWR_CL_26_xxx [201 or 203] */
            supported_pwr_class =
                ( (hmmc->Ext_CSD[(MMC_EXT_CSD_PWR_CL_26_INDEX
                                  / 4)] >> MMC_EXT_CSD_PWR_CL_26_POS)
                  & 0x000000FFU ) ;
        }

        if ( errorstate == HAL_MMC_ERROR_NONE ) {
            if ( Wide == SDMMC_BUS_WIDE_8B ) {
                /* Bit [7:4]: power class for 8-bits bus configuration - Bit [3:0]: power class for 4-bits bus configuration */
                supported_pwr_class = (supported_pwr_class >> 4U) ;
            }

