mazent/STM32/Dispi/mmc/mz_hal_mmc.c
            if ( (power_class & 0x0FU) != (supported_pwr_class & 0x0FU) ) {
                /* Need to change current power class */
                errorstate =
                    SDMMC_CmdSwitch( hmmc->Instance,
                                     ( 0x03BB0000U
                                       | ( (supported_pwr_class & 0x0FU) << 8U ) ) ) ;

                if ( errorstate == HAL_MMC_ERROR_NONE ) {
                    /* While card is not ready for data and trial number for sending CMD13 is not exceeded */
                    count = SDMMC_MAX_TRIAL ;
                    do {
                        errorstate =
                            SDMMC_CmdSendStatus( hmmc->Instance,
                                                 (uint32_t) ( ( (uint32_t) hmmc
                                                                ->MmcCard.
                                                                RelCardAdd )
                                                              << 16U ) ) ;
                        if ( errorstate != HAL_MMC_ERROR_NONE ) {
                            break ;
                        }

                        /* Get command response */
                        response = SDMMC_GetResponse(hmmc->Instance,
                                                     SDMMC_RESP1) ;
                        count-- ;
                    } while ( ( (response & 0x100U) == 0U ) && (count != 0U) ) ;

                    /* Check the status after the switch command execution */
                    if ( (count != 0U) &&
                         (errorstate == HAL_MMC_ERROR_NONE) ) {
                        /* Check the bit SWITCH_ERROR of the device status */
                        if ( (response & 0x80U) != 0U ) {
                            errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE ;
                        }
                    }
                    else if ( count == 0U ) {
                        errorstate = SDMMC_ERROR_TIMEOUT ;
                    }
                    else {
                        /* Nothing to do */
                    }
                }
            }
        }
    }

    return errorstate ;
}

/**
  * @brief Read DMA Buffer 0 Transfer completed callbacks
  * @param hmmc: MMC handle
  * @retval None
  */
__weak void HAL_MMCEx_Read_DMADoubleBuf0CpltCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMCEx_Read_DMADoubleBuf0CpltCallback can be implemented in the user file
     */
}

/**
  * @brief Read DMA Buffer 1 Transfer completed callbacks
  * @param hmmc: MMC handle
  * @retval None
  */
__weak void HAL_MMCEx_Read_DMADoubleBuf1CpltCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMCEx_Read_DMADoubleBuf1CpltCallback can be implemented in the user file
     */
}

/**
  * @brief Write DMA Buffer 0 Transfer completed callbacks
  * @param hmmc: MMC handle
  * @retval None
  */
__weak void HAL_MMCEx_Write_DMADoubleBuf0CpltCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMCEx_Write_DMADoubleBuf0CpltCallback can be implemented in the user file
     */
}

/**
  * @brief Write DMA Buffer 1 Transfer completed callbacks
  * @param hmmc: MMC handle
  * @retval None
  */
__weak void HAL_MMCEx_Write_DMADoubleBuf1CpltCallback(MMC_HandleTypeDef * hmmc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hmmc) ;

    /* NOTE : This function should not be modified, when the callback is needed,
              the HAL_MMCEx_Write_DMADoubleBuf1CpltCallback can be implemented in the user file
     */
}

/************************************************
 * AGGIUNTE
 *
 * Uso il comando 23 in modo da poter accedere alla partizione RPMB
 *
 * Questo va fatto prima di invocare le funzioni seguenti
 * con la mmc_cmd23()
 *
 */

#include <stdbool.h>

HAL_StatusTypeDef mmc_writeblocks_dma(
    MMC_HandleTypeDef * hmmc,
    uint8_t * pData,
    uint32_t BlockAdd,
    uint32_t NumberOfBlocks)
{
    SDMMC_DataInitTypeDef config ;
    uint32_t errorstate ;
    uint32_t add = BlockAdd ;

    if ( NULL == pData ) {
        hmmc->ErrorCode |= HAL_MMC_ERROR_PARAM ;
        return HAL_ERROR ;
    }

    if ( hmmc->State == HAL_MMC_STATE_READY ) {
        hmmc->ErrorCode = HAL_MMC_ERROR_NONE ;

        if ( (BlockAdd + NumberOfBlocks) > (hmmc->MmcCard.LogBlockNbr) ) {
            hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_OUT_OF_RANGE ;
            return HAL_ERROR ;
        }

        /* Check the case of 4kB blocks (field DATA SECTOR SIZE of extended CSD register) */
        if ( ( (hmmc->Ext_CSD[(MMC_EXT_CSD_DATA_SEC_SIZE_INDEX
                               / 4)]
                >> MMC_EXT_CSD_DATA_SEC_SIZE_POS) & 0x000000FFU ) != 0x0U ) {
            if ( (NumberOfBlocks % 8U) != 0U ) {
                /* The number of blocks should be a multiple of 8 sectors of 512 bytes = 4 KBytes */
                hmmc->ErrorCode |= HAL_MMC_ERROR_BLOCK_LEN_ERR ;
                return HAL_ERROR ;
            }

            if ( (BlockAdd % 8U) != 0U ) {
                /* The address should be aligned to 8 (corresponding to 4 KBytes blocks) */
                hmmc->ErrorCode |= HAL_MMC_ERROR_ADDR_MISALIGNED ;
                return HAL_ERROR ;
            }
        }

        hmmc->State = HAL_MMC_STATE_BUSY ;

        /* Initialize data control register */
        hmmc->Instance->DCTRL = 0U ;

        hmmc->pTxBuffPtr = pData ;
        hmmc->TxXferSize = MMC_BLOCKSIZE * NumberOfBlocks ;

        if ( (hmmc->MmcCard.CardType) != MMC_HIGH_CAPACITY_CARD ) {
            add *= 512U ;
        }

        /* Configure the MMC DPSM (Data Path State Machine) */
        config.DataTimeOut = SDMMC_DATATIMEOUT ;
        config.DataLength = MMC_BLOCKSIZE * NumberOfBlocks ;
        config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B ;
        config.TransferDir = SDMMC_TRANSFER_DIR_TO_CARD ;
        config.TransferMode = SDMMC_TRANSFER_MODE_BLOCK ;
        config.DPSM = SDMMC_DPSM_DISABLE ;
        (void) SDMMC_ConfigData(hmmc->Instance, &config) ;

        __SDMMC_CMDTRANS_ENABLE(hmmc->Instance) ;

